{
	"intents": [
		{
			"tag": "greeting",
			"patterns": [
				"Hi",
				"How are you",
				"Is anyone there?",
				"Hello",
				"Good day"
			],
			"responses": [
				"Hello, thanks for visiting",
				"Good to see you",
				"Hi dear, how can I help?"
			]
		},
		{
			"tag": "goodbye",
			"patterns": [
				"Bye",
				"See you later",
				"Goodbye",
				"tata"
			],
			"responses": [
				"See you later, thanks for visiting",
				"Have a nice day",
				"Bye! Come back again soon."
			]
		},
		{
			"tag": "thanks",
			"patterns": [
				"Thanks",
				"Thank you",
				"That's helpful",
				"Thanks for the help"
			],
			"responses": [
				"Happy to help!",
				"Any time!",
				"My pleasure"
			]
		},
		{
			"tag": "name",
			"patterns": [
				"What is your name?",
				"Who are you?",
				"Tell me your name"
			],
			"responses": [
				"Bili",
				" My name is Bili",
				"i'm Bili"
			]
		},
		{
			"tag": "iubnfo",
			"patterns": [
				"What is the name of our university?",
				"What is the full name of iub?",
				"Tell me the full form of iub"
			],
			"responses": [
				"Independent University, Bangladesh"
			]
		},
		{
			"tag": "library",
			"patterns": [
				"Where is the library?",
				"Where is the library situated?",
				"Tell me about the library location"
			],
			"responses": [
				"The library is on 3th floor in BC Building",
				"The library is situated in 3th floor",
				"3th floor in BC Building"
			]
		},
		{
			"tag": "lab",
			"patterns": [
				"Where is the CSE lab one?",
				"Where is the CSE lab two?",
				"Where is the CSE lab three?",
				"Where is the CSE lab GPL?",
				"Where is the computer lab situated?",
				"Tell me about the computer lab location",
				"Computer lab"
			],
			"responses": [
				"The computer lab is on 4th floor in BC Building",
				"The computer lab is situated in 4th floor in BC Building",
				"4th floor in BC Building"
			]
		},
		{
			"tag": "phylab",
			"patterns": [
				"Where is the Physics lab?",
				"Where is the physics lab situated?",
				"Tell me about the physics lab location",
				"Physics lab"
			],
			"responses": [
				"The Physics lab is on 6th floor in BC Builging",
				"The computer lab is situated in 6th floor in BC Builging",
				"6th floor in BC Builging"
			]
		},
		{
			"tag": "hours",
			"patterns": [
				"What hours are you open?",
				"What are your hours?",
				"When are you open?"
			],
			"responses": [
				"We're open every day 8.00am-9.00pm",
				"Our hours are 8.00am-9.00pm every day"
			]
		},
		{
			"tag": "departmentheadofcse",
			"patterns": [
				"Who is the department head of CSE department?",
				"Who is the department head of Computer Science & Engineering Department?",
				"What is the name of the department head of CSE Department?"
			],
			"responses": [
				"Dr. Saadia Binte Alam"
			]
		},
		{
			"tag": "SaadiaBinteAlam",
			"patterns": [
				"Can you please tell me details of Dr. Saadia Binte Alam?",
				"Please tell me the details of Saadia Binte Alam from CSE?"
			],
			"responses": [
				"Dr. Saadia Binte Alam is Associate Professor and Head of the Computer Science & Engineering Department (CSE). Her Room: BC 5007D, E-mail: saadiabinte@iub.edu.bd"
			]
		},
		{
			"tag": "MdAshrafulAmin",
			"patterns": [
				"Can you please tell me details of Dr. Md Ashraful Amin?",
				"Please tell me the details of Md Ashraful Amin from CSE?"
			],
			"responses": [
				"Dr. Md Ashraful Amin is a Professor in the Computer Science & Engineering Department (CSE). His Room: BC 5001D, E-mail: aminmdashraful@iub.edu.bd"
			]
		},
		{
			"tag": "AKMMahbuburRahman",
			"patterns": [
				"Can you please tell me details of Dr. A K M Mahbubur Rahman?",
				"Please tell me the details of A K M Mahbubur Rahman from CSE?"
			],
			"responses": [
				"Dr. A K M Mahbubur Rahman is an Associate Professor in the Computer Science & Engineering Department (CSE). His Room: C 7008, E-mail: akmmrahman@iub.edu.bd"
			]
		},
		{
			"tag": "AminAhsanAli",
			"patterns": [
				"Can you please tell me details of Dr. Amin Ahsan Ali?",
				"Please tell me the details of Amin Ahsan Ali from CSE?"
			],
			"responses": [
				"Dr. Amin Ahsan Ali is an Associate Professor in the Computer Science & Engineering Department (CSE). His Room: BC 6003, E-mail: aminali@iub.edu.bd"
			]
		},
		{
			"tag": "FerdowsZahid",
			"patterns": [
				"Can you please tell me details of Dr. Ferdows Zahid?",
				"Please tell me the details of Ferdows Zahid from CSE?"
			],
			"responses": [
				"Dr. Ferdows Zahid is an Associate Professor in the Computer Science & Engineering Department (CSE). His Room: BC 6006, E-mail: fzahid@iub.edu.bd"
			]
		},
		{
			"tag": "MMMahbubulSyeed",
			"patterns": [
				"Can you please tell me details of Dr. M M Mahbubul Syeed?",
				"Please tell me the details of M M Mahbubul Syeed from CSE?"
			],
			"responses": [
				"Dr. M M Mahbubul Syeed is an Associate Professor in the Computer Science & Engineering Department (CSE). His Room: C 7002, E-mail: mahbubul.syeed@iub.edu.bd"
			]
		},
		{
			"tag": "MahadyHasan",
			"patterns": [
				"Can you please tell me details of Dr. Mahady Hasan?",
				"Please tell me the details of Mahady Hasan from CSE?"
			],
			"responses": [
				"Dr. Mahady Hasan is an Associate Professor in the Computer Science & Engineering Department (CSE). His Room: BC 6001, E-mail: mahady@iub.edu.bd"
			]
		},
		{
			"tag": "MohammadFaisalUddin",
			"patterns": [
				"Can you please tell me details of Dr. Mohammad Faisal Uddin?",
				"Please tell me the details of Mohammad Faisal Uddin from CSE?"
			],
			"responses": [
				"Dr. Mohammad Faisal Uddin is an Associate Professor in the Computer Science & Engineering Department (CSE). His Room: BC 5001F, E-mail: faisal@iub.edu.bd"
			]
		},
		{
			"tag": "TaremAhmed",
			"patterns": [
				"Can you please tell me details of Dr. Tarem Ahmed?",
				"Please tell me the details of Tarem Ahmed from CSE?"
			],
			"responses": [
				"Dr. Tarem Ahmed is an Associate Professor in the Computer Science & Engineering Department (CSE). His Room: C 7011, E-mail: tarem@iub.edu.bd"
			]
		},
		{
			"tag": "AshrafulIslam",
			"patterns": [
				"Can you please tell me details of Dr. Ashraful Islam?",
				"Please tell me the details of Ashraful Islam from CSE?"
			],
			"responses": [
				"Dr. Ashraful Islam is an Assistant Professor in the Computer Science & Engineering Department (CSE). His Room: MK 8004, E-mail: ashraful@iub.edu.bd"
			]
		},
		{
			"tag": "AsifMahmood",
			"patterns": [
				"Can you please tell me details of Dr. Asif Mahmood?",
				"Please tell me the details of Asif Mahmood from CSE?"
			],
			"responses": [
				"Dr. Asif Mahmood is an Assistant Professor in the Computer Science & Engineering Department (CSE). His Room: C 7004, E-mail: asif.mahmood@iub.edu.bd"
			]
		},
		{
			"tag": "FarzanaRahman",
			"patterns": [
				"Can you please tell me details of Dr. Farzana Rahman?",
				"Please tell me the details of Farzana Rahman from CSE?"
			],
			"responses": [
				"Dr. Farzana Rahman is an Assistant Professor in the Computer Science & Engineering Department (CSE). Her Room: C 7016, E-mail: farzana.rahman@iub.edu.bd"
			]
		},
		{
			"tag": "MdShakhawatHossain",
			"patterns": [
				"Can you please tell me details of Dr. Md Shakhawat Hossain?",
				"Please tell me the details of Md Shakhawat Hossain from CSE?"
			],
			"responses": [
				"Dr. Md Shakhawat Hossain is an Assistant Professor in the Computer Science & Engineering Department (CSE). His Room: C 7015, E-mail: shakhawat@iub.edu.bd"
			]
		},
		{
			"tag": "MdTarekHabib",
			"patterns": [
				"Can you please tell me details of Dr. Md Tarek Habib?",
				"Please tell me the details of Md Tarek Habib from CSE?"
			],
			"responses": [
				"Dr. Md Tarek Habib is an Assistant Professor in the Computer Science & Engineering Department (CSE). His Room: BC, E-mail: tarek@iub.edu.bd"
			]
		},
		{
			"tag": "MdZahangirAlam",
			"patterns": [
				"Can you please tell me details of Dr. Md Zahangir Alam?",
				"Please tell me the details of Md Zahangir Alam from CSE?"
			],
			"responses": [
				"Dr. Md Zahangir Alam is an Assistant Professor in the Computer Science & Engineering Department (CSE). His Room: BC, E-mail: zahangir.alam@iub.edu.bd"
			]
		},
		{
			"tag": "MohammadShidujaman",
			"patterns": [
				"Can you please tell me details of Dr. Mohammad Shidujaman?",
				"Please tell me the details of Mohammad Shidujaman from CSE?"
			],
			"responses": [
				"Dr. Mohammad Shidujaman is an Assistant Professor in the Computer Science & Engineering Department (CSE). His Room: BC, E-mail: shidujaman@iub.edu.bd"
			]
		},
		{
			"tag": "RazibHayatKhan",
			"patterns": [
				"Can you please tell me details of Dr. Razib Hayat Khan?",
				"Please tell me the details of Razib Hayat Khan from CSE?"
			],
			"responses": [
				"Dr. Razib Hayat Khan is an Assistant Professor in the Computer Science & Engineering Department (CSE). His Room: C 7007, E-mail: rkhan@iub.edu.bd"
			]
		},
		{
			"tag": "AjmiriSabrinaKhan",
			"patterns": [
				"Can you please tell me details of Ms. Ajmiri Sabrina Khan?",
				"Please tell me the details of Ajmiri Sabrina Khan from CSE?"
			],
			"responses": [
				"Ms. Ajmiri Sabrina Khan is a Lecturer A in the Computer Science & Engineering Department (CSE). Her Room: C 7003, E-mail: ajmirikhan@iub.edu.bd"
			]
		},
		{
			"tag": "BijoyRahmanArif",
			"patterns": [
				"Can you please tell me details of Mr. Bijoy Rahman Arif?",
				"Please tell me the details of Bijoy Rahman Arif from CSE?"
			],
			"responses": [
				"Mr. Bijoy Rahman Arif is a Lecturer A in the Computer Science & Engineering Department (CSE). His Room: BC 5010, E-mail: bijoyarif@iub.edu.bd"
			]
		},
		{
			"tag": "KanizFatema",
			"patterns": [
				"Can you please tell me details of Ms. Kaniz Fatema?",
				"Please tell me the details of Kaniz Fatema from CSE?"
			],
			"responses": [
				"Ms. Kaniz Fatema is a Lecturer A in the Computer Science & Engineering Department (CSE). Her Room: C 7003, E-mail: kaniz.fatema@iub.edu.bd"
			]
		},
		{
			"tag": "MdAbuSayed",
			"patterns": [
				"Can you please tell me details of Mr. Md Abu Sayed?",
				"Please tell me the details of Md Abu Sayed from CSE?"
			],
			"responses": [
				"Mr. Md Abu Sayed is a Lecturer A in the Computer Science & Engineering Department (CSE). His Room: BC 5010, E-mail: asayed@iub.edu.bd"
			]
		},
		{
			"tag": "MdAsifBinKhaled",
			"patterns": [
				"Can you please tell me details of Mr. Md Asif Bin Khaled?",
				"Please tell me the details of Md Asif Bin Khaled from CSE?"
			],
			"responses": [
				"Mr. Md Asif Bin Khaled is a Lecturer A in the Computer Science & Engineering Department (CSE). His Room: BC 5010D, E-mail: mdasifbinkhaled@iub.edu.bd"
			]
		},
		{
			"tag": "MdFahadMonir",
			"patterns": [
				"Can you please tell me details of Mr. Md Fahad Monir?",
				"Please tell me the details of Md Fahad Monir from CSE?"
			],
			"responses": [
				"Mr. Md Fahad Monir is a Lecturer A in the Computer Science & Engineering Department (CSE). His Room: BC 5010, E-mail: fahad.monir@iub.edu.bd"
			]
		},
		{
			"tag": "MohammadNoorNabi",
			"patterns": [
				"Can you please tell me details of Mr. Mohammad Noor Nabi?",
				"Please tell me the details of Mohammad Noor Nabi from CSE?"
			],
			"responses": [
				"Mr. Mohammad Noor Nabi is a Lecturer A in the Computer Science & Engineering Department (CSE). His Room: BC 6005, E-mail: mnnabi@iub.edu.bd"
			]
		},
		{
			"tag": "SabrinaAlam",
			"patterns": [
				"Can you please tell me details of Ms. Sabrina Alam?",
				"Please tell me the details of Sabrina Alam from CSE?"
			],
			"responses": [
				"Ms. Sabrina Alam is a Lecturer A in the Computer Science & Engineering Department (CSE). Her Room: BC 5007, E-mail: sabrina.alam@iub.edu.bd"
			]
		},
		{
			"tag": "SanzarAdnanAlam",
			"patterns": [
				"Can you please tell me details of Mr. Sanzar Adnan Alam?",
				"Please tell me the details of Sanzar Adnan Alam from CSE?"
			],
			"responses": [
				"Mr. Sanzar Adnan Alam is a Lecturer A in the Computer Science & Engineering Department (CSE). His Room: BC 6005, E-mail: sanzar@iub.edu.bd"
			]
		},
		{
			"tag": "SubrataKumarDey",
			"patterns": [
				"Can you please tell me details of Mr. Subrata Kumar Dey?",
				"Please tell me the details of Subrata Kumar Dey from CSE?"
			],
			"responses": [
				"Mr. Subrata Kumar Dey is a Lecturer A in the Computer Science & Engineering Department (CSE). His Room: BC 6005C, E-mail: subrata@iub.edu.bd"
			]
		},
		{
			"tag": "AsifMahmud",
			"patterns": [
				"Can you please tell me details of Mr. Asif Mahmud?",
				"Please tell me the details of Asif Mahmud from CSE?"
			],
			"responses": [
				"Mr. Asif Mahmud is a Lecturer B in the Computer Science & Engineering Department (CSE). His Room: BC 5010, E-mail: asif@iub.edu.bd"
			]
		},
		{
			"tag": "MohammadMotiurRahman",
			"patterns": [
				"Can you please tell me details of Mr. Mohammad Motiur Rahman?",
				"Please tell me the details of Mohammad Motiur Rahman from CSE?"
			],
			"responses": [
				"Mr. Mohammad Motiur Rahman is a Lecturer B in the Computer Science & Engineering Department (CSE). His Room: BC 5010, E-mail: motiur@iub.edu.bd"
			]
		},
		{
			"tag": "SajedImtenanulHaque",
			"patterns": [
				"Can you please tell me details of Mr. Sajed Imtenanul Haque?",
				"Please tell me the details of Sajed Imtenanul Haque from CSE?"
			],
			"responses": [
				"Mr. Sajed Imtenanul Haque is a Lecturer B in the Computer Science & Engineering Department (CSE). His Room: BC 6005B, E-mail: imtenanul@iub.edu.bd"
			]
		},
		{
			"tag": "departmentheadofM&C",
			"patterns": [
				"Who is the department head of M&C department?",
				"Who is the department head of of Media and Communication Department?",
				"What is the name of the department head of M&C Department?"
			],
			"responses": [
				"Dr. Zakir Hossain Raju"
			]
		},
		{
			"tag": "DepartmentHeadofmediaAndCommunication",
			"patterns": [
				"Could you please tell me details of Zakir Hossain Raju Sir?",
				"Tell me information about Zakir Hossain Raju of Media and Communication Department ?"
			],
			"responses": [
				"Dr. Zakir Hossain Raju is Department Head of Media and Communication department ,Room: BC 7001D ,E-mail: zhraju@iub.edu.bd"
			]
		},
		{
			"tag": "ZakirHossainRaju",
			"patterns": [
				"Could you please tell me details of Zakir Hossain Raju Sir?",
				"Tell me information about Zakir Hossain Raju of Media and Communication Department ?"
			],
			"responses": [
				"Dr. Zakir Hossain Raju is Department Head of Media and Communication department ,Room: BC 7001D ,E-mail: zhraju@iub.edu.bd"
			]
		},
		{
			"tag": "ImranFirdaus",
			"patterns": [
				"Could you please tell me details of Imran Firdaus Sir?",
				"Tell me information about Imran Firdaus of Media and Communication Department ?"
			],
			"responses": [
				"Dr. Imran Firdaus is Assistant Professor of Media and Communication department ,E-mail: imran@iub.edu.bd"
			]
		},
		{
			"tag": "MohiulIslam",
			"patterns": [
				"Could you please tell me details of Md. Mohiul Islam Sir?",
				"Tell me information about Md. Mohiul Islam of Media and Communication Department ?"
			],
			"responses": [
				"Dr. Md. Mohiul Islam is Assistant Professor of Media and Communication department ,Room: BC BC7001, E-mail: mohiul@iub.edu.bd"
			]
		},
		{
			"tag": "ZohaRahman",
			"patterns": [
				"Could you please tell me details of Zoha Rahman Miss?",
				"Tell me information about Zoha Rahman of Media and Communication Department ?"
			],
			"responses": [
				"Dr. Zoha Rahman is Assistant Professor of Media and Communication department, Room: BC 7001, E-mail: joha_dusbe@iub.edu.bd"
			]
		},
		{
			"tag": "DilshadHossainDodul",
			"patterns": [
				"Could you please tell me details of Dilshad Hossain Dodul Miss?",
				"Tell me information about Dilshad Hossain Dodul of Media and Communication Department ?"
			],
			"responses": [
				"Dilshad Hossain Dodul is Lecturer A of Media and Communication department, Room: BC7001, E-mail: joha_dusbe@iub.edu.bd"
			]
		},
		{
			"tag": "JaninaIslamAbir",
			"patterns": [
				"Could you please tell me details of Janina Islam Abir Miss?",
				"Tell me information about Janina Islam Abir of Media and Communication Department ?"
			],
			"responses": [
				"Janina Islam Abir is Lecturer A of Media and Communication department, Room: C 8016, E-mail: janina@iub.edu.bd"
			]
		},
		{
			"tag": "MahmudHasanKayesh",
			"patterns": [
				"Could you please tell me details of Mahmud Hasan Kayesh Sir?",
				"Tell me information about Mahmud Hasan Kayesh of Media and Communication Department ?"
			],
			"responses": [
				"Mahmud Hasan Kayesh is Lecturer A of Media and Communication department, Room: BC 7001, E-mail: mhkayesh@iub.edu.bd"
			]
		},
		{
			"tag": "RaisaRasheeka",
			"patterns": [
				"Could you please tell me details of Raisa Rasheeka Miss?",
				"Tell me information about Raisa Rasheeka of Media and Communication Department ?"
			],
			"responses": [
				"Raisa Rasheeka is Lecturer A of Media and Communication department, Room:  BC 7007C, E-mail: raisa@iub.edu.bd"
			]
		},
		{
			"tag": "Raiyana Rahman",
			"patterns": [
				"Could you please tell me details of Raiyana Rahman Miss?",
				"Tell me information about Raiyana Rahman of Media and Communication Department ?"
			],
			"responses": [
				"Raiyana Rahman is Lecturer A of Media and Communication department, Room:  BC 7008D, E-mail: raiyana@iub.edu.bd"
			]
		},
		{
			"tag": "TasneemShahrukh",
			"patterns": [
				"Could you please tell me details of Tasneem Shahrukh Miss?",
				"Tell me information about Tasneem Shahrukh of Media and Communication Department ?"
			],
			"responses": [
				"Tasneem Shahrukh is Lecturer A of Media and Communication department, Room:  BC 7001A, E-mail: tasneem@iub.edu.bd"
			]
		},
		{
			"tag": "FariyaHossainKhan",
			"patterns": [
				"Could you please tell me details of Fariya Hossain Khan Miss?",
				"Tell me information about Fariya Hossain Khan of Media and Communication Department ?"
			],
			"responses": [
				"Fariya Hossain Khan is Lecturer B of Media and Communication department, Room:  BC 7008A, E-mail: fariya@iub.edu.bd"
			]
		},
		{
			"tag": "Momtaz Parvin",
			"patterns": [
				"Could you please tell me details of Momtaz Parvin Khan Miss?",
				"Tell me information about Momtaz Parvin of Media and Communication Department ?"
			],
			"responses": [
				"Momtaz Parvin is Lecturer B of Media and Communication department, Room:  BC 7007D, E-mail: mumu@iub.edu.bd"
			]
		},
		{
			"tag": "MushfeqaIslam",
			"patterns": [
				"Could you please tell me details of Mushfeqa Islam Miss?",
				"Tell me information about Mushfeqa Islam of Media and Communication Department ?"
			],
			"responses": [
				"Mushfeqa Islam is Lecturer B of Media and Communication department, Room:  BC 7008, E-mail: mushfeqa@iub.edu.bd"
			]
		},
		{
			"tag": "RefatAraJerin",
			"patterns": [
				"Could you please tell me details of Refat Ara Jerin Miss?",
				"Tell me information about Refat Ara Jerin of Media and Communication Department ?"
			],
			"responses": [
				"Refat Ara Jerin is Lecturer B of Media and Communication department, Room:  BC  7007D, E-mail: rjerin@iub.edu.bd"
			]
		},
		{
			"tag": "MustafaHabibChowdhury",
			"patterns": [
				"Can you tell me details about Mustafa Habib Chowdhury?",
				"Please provide information on Dr Mustafa Habib Chowdhury from EEE?"
			],
			"responses": [
				"Dr. Mustafa Habib Chowdhury is the Associate Professor and Head of the Department of Electrical and Electronic Engineering (EEE). His office is located at Room BC 5011B, and his email is mchowdhury@iub.edu.bd."
			]
		},
		{
			"tag": "MamunBinIbneReaz",
			"patterns": [
				"Can you tell me details about Mamun Bin Ibne Reaz?",
				"Please provide information on Dr Mamun Bin Ibne Reaz from EEE?"
			],
			"responses": [
				"Dr. Mamun Bin Ibne Reaz is a Professor at the Department of Electrical and Electronic Engineering (EEE). His office is located at Room BC 6001, and his email is mamun.reaz@iub.edu.bd."
			]
		},
		{
			"tag": "FerozAhmed",
			"patterns": [
				"Can you tell me details about Feroz Ahmed?",
				"Please provide information on Dr Feroz Ahmed from EEE?"
			],
			"responses": [
				"Dr. Feroz Ahmed is a Professor at the Department of Electrical and Electronic Engineering (EEE). His office is located at Room BC 5009E, and his email is fahmed@iub.edu.bd."
			]
		},
		{
			"tag": "KhosruMohammadSalim",
			"patterns": [
				"Can you tell me details about Khosru Mohammad Salim?",
				"Please provide information on Dr Khosru Mohammad Salim from EEE?"
			],
			"responses": [
				"Dr. Khosru Mohammad Salim is a Professor at the Department of Electrical and Electronic Engineering (EEE). His office is located at Room BC 5009C, and his email is khosru@iub.edu.bd."
			]
		},
		{
			"tag": "MdAbdurRazzak",
			"patterns": [
				"Can you tell me details about Md Abdur Razzak?",
				"Please provide information on Dr Md Abdur Razzak from EEE?"
			],
			"responses": [
				"Dr. Md Abdur Razzak is a Professor at the Department of Electrical and Electronic Engineering (EEE). His office is located at Room BC 5009F, and his email is razzak@iub.edu.bd."
			]
		},
		{
			"tag": "ShahriarKhan",
			"patterns": [
				"Can you tell me details about Shahriar Khan?",
				"Please provide information on Dr Shahriar Khan from EEE?"
			],
			"responses": [
				"Dr. Shahriar Khan is a Professor at the Department of Electrical and Electronic Engineering (EEE). His office is located at Room BC 5009A, and his email is skhan@iub.edu.bd."
			]
		},
		{
			"tag": "MdKafiulIslam",
			"patterns": [
				"Can you tell me details about Md Kafiul Islam?",
				"Please provide information on Dr Md Kafiul Islam from EEE?"
			],
			"responses": [
				"Dr. Md Kafiul Islam is an Associate Professor at the Department of Electrical and Electronic Engineering (EEE). His office is located at Room BC 6006B, and his email is kafiul_islam@iub.edu.bd."
			]
		},
		{
			"tag": "AfrozaSultana",
			"patterns": [
				"Can you tell me details about Afroza Sultana?",
				"Please provide information on Afroza Sultana from EEE?"
			],
			"responses": [
				"Afroza Sultana is a Lecturer A at the Department of Electrical and Electronic Engineering (EEE). Her office is located at Room BC 6004D, and her email is afroza@iub.edu.bd."
			]
		},
		{
			"tag": "NavilaRahmanNadi",
			"patterns": [
				"Can you tell me details about Navila Rahman Nadi?",
				"Please provide information on Navila Rahman Nadi from EEE?"
			],
			"responses": [
				"Navila Rahman Nadi is a Lecturer A at the Department of Electrical and Electronic Engineering (EEE). Her office is located at Room BC 5007A, and her email is navila@iub.edu.bd."
			]
		},
		{
			"tag": "BijoyaLala",
			"patterns": [
				"Can you tell me details about Bijoya Lala?",
				"Please provide information on Bijoya Lala from EEE?"
			],
			"responses": [
				"Bijoya Lala is a Lecturer B at the Department of Electrical and Electronic Engineering (EEE). Her office is located at Room BC 6004D, and her email is bijoya@iub.edu.bd."
			]
		},
		{
			"tag": "EmranulHaque",
			"patterns": [
				"Can you tell me details about Emranul Haque?",
				"Please provide information on Emranul Haque from EEE?"
			],
			"responses": [
				"Emranul Haque is a Lecturer B at the Department of Electrical and Electronic Engineering (EEE). His office is located at Room BC 5016-5018B, and his email is emran1612@iub.edu.bd."
			]
		},
		{
			"tag": "IstiakAhmed",
			"patterns": [
				"Can you tell me details about Istiak Ahmed?",
				"Please provide information on Istiak Ahmed from EEE?"
			],
			"responses": [
				"Istiak Ahmed is a Lecturer B at the Department of Electrical and Electronic Engineering (EEE). His office is located at Room BC 5010B, and his email is istiak@iub.edu.bd."
			]
		},
		{
			"tag": "KhShahriyaZaman",
			"patterns": [
				"Can you tell me details about Kh Shahriya Zaman?",
				"Please provide information on Kh Shahriya Zaman from EEE?"
			],
			"responses": [
				"Kh Shahriya Zaman is a Lecturer B at the Department of Electrical and Electronic Engineering (EEE). His office is located at Room BC 5010C, and his email is shahriya@iub.edu.bd."
			]
		},
		{
			"tag": "NaureenRahnuma",
			"patterns": [
				"Can you tell me details about Naureen Rahnuma?",
				"Please provide information on Dr. Naureen Rahnuma from English?"
			],
			"responses": [
				"Dr. Naureen Rahnuma is an Assistant Professor and Head of the Dept. of English. Her office is located at Room BC 8005C, and her email is naureen@iub.edu.bd."
			]
		},
		{
			"tag": "AhmedAhsanuzzaman",
			"patterns": [
				"Can you tell me details about Ahmed Ahsanuzzaman?",
				"Please provide information on Dr. Ahmed Ahsanuzzaman from English?"
			],
			"responses": [
				"Dr. Ahmed Ahsanuzzaman is a Professor in the Dept. of English. His office is located at Room BC 8009, and his email is ahsanuzzaman@iub.edu.bd."
			]
		},
		{
			"tag": "MahmudHasanKhan",
			"patterns": [
				"Can you tell me details about Mahmud Hasan Khan?",
				"Please provide information on Dr. Mahmud Hasan Khan from English?"
			],
			"responses": [
				"Dr. Mahmud Hasan Khan is a Professor in the Dept. of English. His office is located at Room BC BC8008, MK-9005 E (SCMLE), and his email is mahmud.hasan@iub.edu.bd."
			]
		},
		{
			"tag": "RaziaSultanaKhan",
			"patterns": [
				"Can you tell me details about Razia Sultana Khan?",
				"Please provide information on Dr. Razia Sultana Khan from English?"
			],
			"responses": [
				"Dr. Razia Sultana Khan is a Professor in the Dept. of English. Her office is located at Room BC 8009, and her email is rsultana@iub.edu.bd."
			]
		},
		{
			"tag": "HafizaNilofarKhan",
			"patterns": [
				"Can you tell me details about Hafiza Nilofar Khan?",
				"Please provide information on Dr. Hafiza Nilofar Khan from English?"
			],
			"responses": [
				"Dr. Hafiza Nilofar Khan is an Associate Professor in the Dept. of English. Her office is located at Room BC 8006, and her email is hafiza@iub.edu.bd."
			]
		},
		{
			"tag": "MuhammadZakaria",
			"patterns": [
				"Can you tell me details about Muhammad Zakaria?",
				"Please provide information on Dr. Muhammad Zakaria from English?"
			],
			"responses": [
				"Dr. Muhammad Zakaria is an Associate Professor in the Dept. of English. His office is located at Room MK 9005 (F), and his email is rehman.zakaria@iub.edu.bd."
			]
		},
		{
			"tag": "NageshRao",
			"patterns": [
				"Can you tell me details about Nagesh Rao?",
				"Please provide information on Dr. Nagesh Rao from English?"
			],
			"responses": [
				"Dr. Nagesh Rao is an Associate Professor in the Dept. of English. His office is located at Room BC 7008 C, and his email is nagesh@iub.edu.bd."
			]
		},
		{
			"tag": "SarkerHasanAlZayed",
			"patterns": [
				"Can you tell me details about Sarker Hasan Al Zayed?",
				"Please provide information on Dr. Sarker Hasan Al Zayed from English?"
			],
			"responses": [
				"Dr. Sarker Hasan Al Zayed is an Associate Professor in the Dept. of English. His office is located at Room BC 8006B, and his email is hasan.zayed@iub.edu.bd."
			]
		},
		{
			"tag": "MdShaifulIslam",
			"patterns": [
				"Can you tell me details about Md Shaiful Islam?",
				"Please provide information on Dr. Md Shaiful Islam from English?"
			],
			"responses": [
				"Dr. Md Shaiful Islam is an Assistant Professor in the Dept. of English. His office is located at Room BC 8010, and his email is sayeef77@iub.edu.bd."
			]
		},
		{
			"tag": "TowhidBinMuzaffar",
			"patterns": [
				"Can you tell me details about Towhid Bin Muzaffar?",
				"Please provide information on Dr. Towhid Bin Muzaffar from English?"
			],
			"responses": [
				"Dr. Towhid Bin Muzaffar is an Assistant Professor in the Dept. of English. His office is located at Room BC 8006, and his email is towhid@iub.edu.bd."
			]
		},
		{
			"tag": "XingkuiWang",
			"patterns": [
				"Can you tell me details about Xingkui Wang?",
				"Please provide information on Dr. Xingkui Wang from English?"
			],
			"responses": [
				"Dr. Xingkui Wang is an Assistant Professor in the Dept. of English. His email is xingkui@iub.edu.bd."
			]
		},
		{
			"tag": "MithilaMahfuz",
			"patterns": [
				"Can you tell me details about Mithila Mahfuz?",
				"Please provide information on Mithila Mahfuz from English?"
			],
			"responses": [
				"Mithila Mahfuz is a Lecturer A in the Dept. of English. Her office is located at Room BC 8005, and her email is mmithila@iub.edu.bd."
			]
		},
		{
			"tag": "RezinaNazneenRimi",
			"patterns": [
				"Can you tell me details about Rezina Nazneen Rimi?",
				"Please provide information on Rezina Nazneen Rimi from English?"
			],
			"responses": [
				"Rezina Nazneen Rimi is a Lecturer A in the Dept. of English. Her office is located at Room BC 8005, and her email is rimi@iub.edu.bd."
			]
		},
		{
			"tag": "SaaraZabeen",
			"patterns": [
				"Can you tell me details about Saara Zabeen?",
				"Please provide information on Saara Zabeen from English?"
			],
			"responses": [
				"Saara Zabeen is a Lecturer A in the Dept. of English. Her office is located at Room BC 8005, and her email is saarazabeen@iub.edu.bd."
			]
		},
		{
			"tag": "SayyedaTunNoorSameera",
			"patterns": [
				"Can you tell me details about Sayyeda Tun Noor Sameera?",
				"Please provide information on Sayyeda Tun Noor Sameera from English?"
			],
			"responses": [
				"Sayyeda Tun Noor Sameera is a Lecturer A in the Dept. of English. Her office is located at Room BC 8010, and her email is sami@iub.edu.bd."
			]
		},
		{
			"tag": "AdilurRahman",
			"patterns": [
				"Can you tell me details about Adilur Rahman?",
				"Please provide information on Adilur Rahman from English?"
			],
			"responses": [
				"Adilur Rahman is a Lecturer B in the Dept. of English. His office is located at Room BC BC7014, and his email is adil@iub.edu.bd."
			]
		},
		{
			"tag": "AndaleebNavinChoudhury",
			"patterns": [
				"Can you tell me details about Andaleeb Navin Choudhury?",
				"Please provide information on Andaleeb Navin Choudhury from English?"
			],
			"responses": [
				"Andaleeb Navin Choudhury is a Lecturer B in the Dept. of English. His email is andaleeb@iub.edu.bd."
			]
		},
		{
			"tag": "IsratTaslim",
			"patterns": [
				"Can you tell me details about Israt Taslim?",
				"Please provide information on Israt Taslim from English?"
			],
			"responses": [
				"Israt Taslim is a Lecturer B in the Dept. of English. Her office is located at Room BC BC 8005D, and her email is ith@iub.edu.bd."
			]
		},
		{
			"tag": "KanijFatema",
			"patterns": [
				"Can you tell me details about Kanij Fatema?",
				"Please provide information on Kanij Fatema from English?"
			],
			"responses": [
				"Kanij Fatema is a Lecturer B in the Dept. of English. Her email is fatema@iub.edu.bd."
			]
		},
		{
			"tag": "SayeedaSharminChowdhury",
			"patterns": [
				"Can you tell me details about Sayeeda Sharmin Chowdhury?",
				"Please provide information on Sayeeda Sharmin Chowdhury from English?"
			],
			"responses": [
				"Sayeeda Sharmin Chowdhury is a Lecturer B in the Dept. of English. Her email is sayeeda0111@iub.edu.bd."
			]
		},
		{
			"tag": "FarhadAlam",
			"patterns": [
				"Can you tell me details about Farhad Alam?",
				"Please provide information on Dr Farhad Alam from Physical Sciences?"
			],
			"responses": [
				"Dr. Farhad Alam is an Associate Professor and Head of the Department of Physical Sciences at the School of Engineering, Technology and Sciences. His office is located at Room BC 6005D, and his email is farhad@iub.edu.bd."
			]
		},
		{
			"tag": "AhmadMostofaKamal",
			"patterns": [
				"Can you tell me details about Ahmad Mostofa Kamal?",
				"Please provide information on Dr Ahmad Mostofa Kamal from Physical Sciences?"
			],
			"responses": [
				"Dr. Ahmad Mostofa Kamal is a Professor at the Department of Physical Sciences. His office is located at Room BC 6005A, and his email is amkamal@iub.edu.bd."
			]
		},
		{
			"tag": "MArshadMomen",
			"patterns": [
				"Can you tell me details about M Arshad Momen?",
				"Please provide information on Dr M Arshad Momen from Physical Sciences?"
			],
			"responses": [
				"Dr. M Arshad Momen is a Professor at the Department of Physical Sciences. His office is located at Room C, and his email is arshad@iub.edu.bd."
			]
		},
		{
			"tag": "MohammedAnwer",
			"patterns": [
				"Can you tell me details about Mohammed Anwer?",
				"Please provide information on Dr Mohammed Anwer from Physical Sciences?"
			],
			"responses": [
				"Dr. Mohammed Anwer is a Professor at the Department of Physical Sciences. His office is located at Room BC 5008, and his email is manwer@iub.edu.bd."
			]
		},
		{
			"tag": "ShipraBanik",
			"patterns": [
				"Can you tell me details about Shipra Banik?",
				"Please provide information on Dr Shipra Banik from Physical Sciences?"
			],
			"responses": [
				"Dr. Shipra Banik is a Professor at the Department of Physical Sciences. Her office is located at Room BC 6004A, and her email is banik@iub.edu.bd."
			]
		},
		{
			"tag": "AsmaBegum",
			"patterns": [
				"Can you tell me details about Asma Begum?",
				"Please provide information on Dr Asma Begum from Physical Sciences?"
			],
			"responses": [
				"Dr. Asma Begum is an Associate Professor at the Department of Physical Sciences. Her office is located at Room BC 6004C, and her email is ablipi@iub.edu.bd."
			]
		},
		{
			"tag": "HabibBinMuzaffar",
			"patterns": [
				"Can you tell me details about Habib Bin Muzaffar?",
				"Please provide information on Dr Habib Bin Muzaffar from Physical Sciences?"
			],
			"responses": [
				"Dr. Habib Bin Muzaffar is an Associate Professor at the Department of Physical Sciences. His office is located at Room BC 5009D, and his email is habibm@iub.edu.bd."
			]
		},
		{
			"tag": "MdReadulMahmud",
			"patterns": [
				"Can you tell me details about Md Readul Mahmud?",
				"Please provide information on Dr Md Readul Mahmud from Physical Sciences?"
			],
			"responses": [
				"Dr. Md Readul Mahmud is an Associate Professor at the Department of Physical Sciences. His office is located at Room C 7012, and his email is mahmud.readul@iub.edu.bd."
			]
		},
		{
			"tag": "RifatAraRouf",
			"patterns": [
				"Can you tell me details about Rifat Ara Rouf?",
				"Please provide information on Dr Rifat Ara Rouf from Physical Sciences?"
			],
			"responses": [
				"Dr. Rifat Ara Rouf is an Associate Professor at the Department of Physical Sciences. Her office is located at Room BC 6004B, and her email is rifatara@iub.edu.bd."
			]
		},
		{
			"tag": "JewelKumarGhosh",
			"patterns": [
				"Can you tell me details about Jewel Kumar Ghosh?",
				"Please provide information on Dr Jewel Kumar Ghosh from Physical Sciences?"
			],
			"responses": [
				"Dr. Jewel Kumar Ghosh is an Assistant Professor at the Department of Physical Sciences. His office is located at Room C 7014, and his email is jewel.ghosh@iub.edu.bd."
			]
		},
		{
			"tag": "KhanMuhammadBinAsad",
			"patterns": [
				"Can you tell me details about Khan Muhammad Bin Asad?",
				"Please provide information on Dr Khan Muhammad Bin Asad from Physical Sciences?"
			],
			"responses": [
				"Dr. Khan Muhammad Bin Asad is an Assistant Professor at the Department of Physical Sciences. His office is located at Room C 7006, and his email is kasad@iub.edu.bd."
			]
		},
		{
			"tag": "MdAshrafulBabu",
			"patterns": [
				"Can you tell me details about Md Ashraful Babu?",
				"Please provide information on Dr Md Ashraful Babu from Physical Sciences?"
			],
			"responses": [
				"Dr. Md Ashraful Babu is an Assistant Professor at the Department of Physical Sciences. His office is located at Room BC 5007, and his email is ashraful388@iub.edu.bd."
			]
		},
		{
			"tag": "MohammadManirHossainMollah",
			"patterns": [
				"Can you tell me details about Mohammad Manir Hossain Mollah?",
				"Please provide information on Dr Mohammad Manir Hossain Mollah from Physical Sciences?"
			],
			"responses": [
				"Dr. Mohammad Manir Hossain Mollah is an Assistant Professor at the Department of Physical Sciences. His office is located at Room BC 5001 (F), and his email is manir@iub.edu.bd."
			]
		},
		{
			"tag": "NayemaIslamNima",
			"patterns": [
				"Can you tell me details about Nayema Islam Nima?",
				"Please provide information on Dr Nayema Islam Nima from Physical Sciences?"
			],
			"responses": [
				"Dr. Nayema Islam Nima is an Assistant Professor at the Department of Physical Sciences. Her office is located at Room BC 5007, and her email is nayema@iub.edu.bd."
			]
		},
		{
			"tag": "KhadizaAkterEme",
			"patterns": [
				"Can you tell me details about Khadiza Akter Eme?",
				"Please provide information on Khadiza Akter Eme from Physical Sciences?"
			],
			"responses": [
				"Khadiza Akter Eme is a Lecturer B at the Department of Physical Sciences. Her email is khadiza@iub.edu.bd."
			]
		},
		{
			"tag": "MdMahbubAlam",
			"patterns": [
				"Can you tell me details about Md Mahbub Alam?",
				"Please provide information on Md Mahbub Alam from Physical Sciences?"
			],
			"responses": [
				"Md Mahbub Alam is a Lecturer B at the Department of Physical Sciences. His office is located at Room BC 5007B, and his email is mdmahbubalam@iub.edu.bd."
			]
		},
		{
			"tag": "MdMehirAmin",
			"patterns": [
				"Can you tell me details about Md Mehir Amin?",
				"Please provide information on Md Mehir Amin from Physical Sciences?"
			],
			"responses": [
				"Md Mehir Amin is a Lecturer B at the Department of Physical Sciences. His office is located at Room BC 5007B, and his email is mdmehiramin@iub.edu.bd."
			]
		},
		{
			"tag": "NadimAhmed",
			"patterns": [
				"Can you tell me details about Nadim Ahmed?",
				"Please provide information on Nadim Ahmed from Physical Sciences?"
			],
			"responses": [
				"Nadim Ahmed is a Lecturer B at the Department of Physical Sciences. His email is nadim@iub.edu.bd."
			]
		},
		{
			"tag": "PurobiRaniKundu",
			"patterns": [
				"Can you tell me details about Purobi Rani Kundu?",
				"Please provide information on Purobi Rani Kundu from Physical Sciences?"
			],
			"responses": [
				"Purobi Rani Kundu is a Lecturer B at the Department of Physical Sciences. Her office is located at Room BC 5007C, and her email is purobikundu@iub.edu.bd."
			]
		},
		{
			"tag": "RumaParvin",
			"patterns": [
				"Can you tell me details about Ruma Parvin?",
				"Please provide information on Ruma Parvin from Physical Sciences?"
			],
			"responses": [
				"Dr. Ruma Parvin is a Lecturer B at the Department of Physical Sciences. Her office is located at Room BC 5007C, and her email is rumaparvin@iub.edu.bd."
			]
		},
		{
			"tag": "SaminaProdhan",
			"patterns": [
				"Can you tell me details about Samina Prodhan?",
				"Please provide information on Samina Prodhan from Physical Sciences?"
			],
			"responses": [
				"Dr. Samina Prodhan is a Lecturer B at the Department of Physical Sciences. Her email is saminaprodhan@iub.edu.bd."
			]
		},
		{
			"tag": "MarufaAkter",
			"patterns": [
				"Can you tell me details about Marufa Akter?",
				"Please provide information on Dr Marufa Akter from Global Studies and Governance?"
			],
			"responses": [
				"Dr. Marufa Akter is an Associate Professor and Head of the Department of Global Studies and Governance. Her office is located at Room BC 8004-C, and her email is marufa@iub.edu.bd."
			]
		},
		{
			"tag": "ImtiazAHussain",
			"patterns": [
				"Can you tell me details about Imtiaz A Hussain?",
				"Please provide information on Dr Imtiaz A Hussain from Global Studies and Governance?"
			],
			"responses": [
				"Dr. Imtiaz A Hussain is a Professor at the Department of Global Studies and Governance. His office is located at Room BC 7009-A, and his email is imtiaz.hussain@iub.edu.bd."
			]
		},
		{
			"tag": "MdShanawezHossain",
			"patterns": [
				"Can you tell me details about Md Shanawez Hossain?",
				"Please provide information on Dr Md Shanawez Hossain from Global Studies and Governance?"
			],
			"responses": [
				"Dr. Md Shanawez Hossain is an Associate Professor at the Department of Global Studies and Governance. His office is located at Room BC 10023C, and his email is shanawez@iub.edu.bd."
			]
		},
		{
			"tag": "FirozaAshravee",
			"patterns": [
				"Can you tell me details about Firoza Ashravee?",
				"Please provide information on Firoza Ashravee from Global Studies and Governance?"
			],
			"responses": [
				"Firoza Ashravee is a Lecturer A at the Department of Global Studies and Governance. Her email is firoza@iub.edu.bd."
			]
		},
		{
			"tag": "MdOhidujjaman",
			"patterns": [
				"Can you tell me details about Md Ohidujjaman?",
				"Please provide information on Md Ohidujjaman from Global Studies and Governance?"
			],
			"responses": [
				"Md Ohidujjaman is a Lecturer A at the Department of Global Studies and Governance. His office is located at Room C 8006, and his email is jaman@iub.edu.bd."
			]
		},
		{
			"tag": "SultanaRazia",
			"patterns": [
				"Can you tell me details about Sultana Razia?",
				"Please provide information on Dr Sultana Razia from Global Studies and Governance?"
			],
			"responses": [
				"Dr. Sultana Razia is a Lecturer A at the Department of Global Studies and Governance. Her office is located at Room BC 8015A, and her email is s.razia@iub.edu.bd."
			]
		},
		{
			"tag": "KaziMahmudurRahman",
			"patterns": [
				"Can you tell me details about Kazi Mahmudur Rahman?",
				"Please provide information on Dr Kazi Mahmudur Rahman from Social Sciences and Humanities?"
			],
			"responses": [
				"Dr. Kazi Mahmudur Rahman is an Associate Professor and Head of the Department of Social Sciences and Humanities. His office is located at Room BC 8003, and his email is mahmudur.rahman@iub.edu.bd."
			]
		},
		{
			"tag": "BokhtiarAhmed",
			"patterns": [
				"Can you tell me details about Bokhtiar Ahmed?",
				"Please provide information on Dr Bokhtiar Ahmed from Social Sciences and Humanities?"
			],
			"responses": [
				"Dr. Bokhtiar Ahmed is a Professor at the Department of Social Sciences and Humanities. His office is located at Room BC 8000, and his email is bokhtiar.ahmed@iub.edu.bd."
			]
		},
		{
			"tag": "ShahnazNasrinIla",
			"patterns": [
				"Can you tell me details about Shahnaz Nasrin Ila?",
				"Please provide information on Dr Shahnaz Nasrin Ila from Social Sciences and Humanities?"
			],
			"responses": [
				"Dr. Shahnaz Nasrin Ila is a Professor and Advisor at the Department of Social Sciences and Humanities. Her email is ila_duslass@iub.edu.bd."
			]
		},
		{
			"tag": "QudrateKhoda",
			"patterns": [
				"Can you tell me details about Qudrate Khoda?",
				"Please provide information on Dr Qudrate Khoda from Social Sciences and Humanities?"
			],
			"responses": [
				"Dr. Qudrate Khoda is an Associate Professor at the Department of Social Sciences and Humanities. His office is located at Room BC 8004-A, and his email is qudrate.khoda@iub.edu.bd."
			]
		},
		{
			"tag": "MdIliasKamalRisat",
			"patterns": [
				"Can you tell me details about Md Ilias Kamal Risat?",
				"Please provide information on Dr Md Ilias Kamal Risat from Social Sciences and Humanities?"
			],
			"responses": [
				"Dr. Md Ilias Kamal Risat is an Assistant Professor at the Department of Social Sciences and Humanities. His office is located at Room BC 7006 B, and his email is risat@iub.edu.bd."
			]
		},
		{
			"tag": "MdRezaHabib",
			"patterns": [
				"Can you tell me details about Md Reza Habib?",
				"Please provide information on Dr Md Reza Habib from Social Sciences and Humanities?"
			],
			"responses": [
				"Dr. Md Reza Habib is an Assistant Professor at the Department of Social Sciences and Humanities. His office is located at Room BC 7006 B, and his email is rezahabib@iub.edu.bd."
			]
		},
		{
			"tag": "NazninAkterBanu",
			"patterns": [
				"Can you tell me details about Naznin Akter Banu?",
				"Please provide information on Dr Naznin Akter Banu from Social Sciences and Humanities?"
			],
			"responses": [
				"Dr. Naznin Akter Banu is an Assistant Professor at the Department of Social Sciences and Humanities. Her office is located at Room BC 7027, and her email is naznin@iub.edu.bd."
			]
		},
		{
			"tag": "MohammadMahfuzulIslam",
			"patterns": [
				"Can you tell me details about Mohammad Mahfuzul Islam?",
				"Please provide information on Mohammad Mahfuzul Islam from Social Sciences and Humanities?"
			],
			"responses": [
				"Mohammad Mahfuzul Islam is a Lecturer A at the Department of Social Sciences and Humanities. His office is located at Room BC 8004B, and his email is mahfuziub@iub.edu.bd."
			]
		},
		{
			"tag": "NaziaMahmood",
			"patterns": [
				"Can you tell me details about Nazia Mahmood?",
				"Please provide information on Dr Nazia Mahmood from Social Sciences and Humanities?"
			],
			"responses": [
				"Dr. Nazia Mahmood is a Lecturer A at the Department of Social Sciences and Humanities. Her office is located at Room BC 7027, and her email is nazia@iub.edu.bd."
			]
		},
		{
			"tag": "ObydullahAlMarjuk",
			"patterns": [
				"Can you tell me details about Obydullah Al Marjuk?",
				"Please provide information on Obydullah Al Marjuk from Social Sciences and Humanities?"
			],
			"responses": [
				"Obydullah Al Marjuk is a Lecturer A at the Department of Social Sciences and Humanities. His office is located at Room BC 7007B, and his email is marjuk@iub.edu.bd."
			]
		},
		{
			"tag": "SharmeenAhmed",
			"patterns": [
				"Can you tell me details about Sharmeen Ahmed?",
				"Please provide information on Sharmeen Ahmed from Social Sciences and Humanities?"
			],
			"responses": [
				"Sharmeen Ahmed is a Lecturer A at the Department of Social Sciences and Humanities. Her office is located at Room BC 8004D, and her email is disha@iub.edu.bd."
			]
		},
		{
			"tag": "MahbubaDewan",
			"patterns": [
				"Can you tell me details about Mahbuba Dewan?",
				"Please provide information on Mahbuba Dewan from Social Sciences and Humanities?"
			],
			"responses": [
				"Mahbuba Dewan is a Lecturer B at the Department of Social Sciences and Humanities. Her office is located at Room BC 8010B, and her email is mahbuba.dewan@iub.edu.bd."
			]
		},
		{
			"tag": "ShejutiNureMaksurat",
			"patterns": [
				"Can you tell me details about Shejuti Nure Maksurat?",
				"Please provide information on Shejuti Nure Maksurat from Social Sciences and Humanities?"
			],
			"responses": [
				"Shejuti Nure Maksurat is a Lecturer B at the Department of Social Sciences and Humanities. Her office is located at Room BC 7027, and her email is maksurat@iub.edu.bd."
			]
		},
		{
			"tag": "MaqboolKaderQuraishi",
			"patterns": [
				"Can you tell me details about Maqbool Kader Quraishi?",
				"Please provide information on Dr Maqbool Kader Quraishi from Accounting?"
			],
			"responses": [
				"Dr. Maqbool Kader Quraishi is an Assistant Professor and Head of the Department of Accounting. His office is located at Room BC 3007, and his email is quraishmk@iub.edu.bd."
			]
		},
		{
			"tag": "MohammadZakariaMasud",
			"patterns": [
				"Can you tell me details about Mohammad Zakaria Masud?",
				"Please provide information on Dr Mohammad Zakaria Masud from Accounting?"
			],
			"responses": [
				"Dr. Mohammad Zakaria Masud is an Associate Professor at the Department of Accounting. His email is zkmasud@iub.edu.bd."
			]
		},
		{
			"tag": "RushdiMdRezaurRazzaque",
			"patterns": [
				"Can you tell me details about Rushdi Md Rezaur Razzaque?",
				"Please provide information on Dr Rushdi Md Rezaur Razzaque from Accounting?"
			],
			"responses": [
				"Dr. Rushdi Md Rezaur Razzaque is an Associate Professor at the Department of Accounting. His office is located at Room BC 4006, and his email is rushdi@iub.edu.bd."
			]
		},
		{
			"tag": "NushratJahan",
			"patterns": [
				"Can you tell me details about Nushrat Jahan?",
				"Please provide information on Dr Nushrat Jahan from Accounting?"
			],
			"responses": [
				"Dr. Nushrat Jahan is an Assistant Professor at the Department of Accounting. Her office is located at Room BC 4009A, and her email is njahan@iub.edu.bd."
			]
		},
		{
			"tag": "MdSafiuddin",
			"patterns": [
				"Can you tell me details about Md Safiuddin?",
				"Please provide information on Md Safiuddin from Accounting?"
			],
			"responses": [
				"Md. Safiuddin is a Lecturer A at the Department of Accounting. His office is located at Room BC 2007, and his email is safiuddin@iub.edu.bd."
			]
		},
		{
			"tag": "NaveedAdnanSiddiquee",
			"patterns": [
				"Can you tell me details about Naveed Adnan Siddiquee?",
				"Please provide information on Naveed Adnan Siddiquee from Accounting?"
			],
			"responses": [
				"Naveed Adnan Siddiquee is a Lecturer A at the Department of Accounting. His office is located at Room BC 4004, and his email is naveedadnan@iub.edu.bd."
			]
		},
		{
			"tag": "MdTanvirIslam",
			"patterns": [
				"Can you tell me details about Md Tanvir Islam?",
				"Please provide information on Md Tanvir Islam from Accounting?"
			],
			"responses": [
				"Md. Tanvir Islam is a Lecturer B at the Department of Accounting. His office is located at Room BC 4004, and his email is tanvir@iub.edu.bd."
			]
		},
		{
			"tag": "MdKhaledSaifullah",
			"patterns": [
				"Can you tell me details about Md Khaled Saifullah?",
				"Please provide information on Dr Md Khaled Saifullah from Economics?"
			],
			"responses": [
				"Dr. Md Khaled Saifullah is an Assistant Professor and Head of the Department of Economics. His office is located at Room BC 3006B, and his email is khaled@iub.edu.bd."
			]
		},
		{
			"tag": "MeherunAhmed",
			"patterns": [
				"Can you tell me details about Meherun Ahmed?",
				"Please provide information on Dr Meherun Ahmed from Economics?"
			],
			"responses": [
				"Dr. Meherun Ahmed is a Professor at the Department of Economics. Her office is located at Room BC 2001, and her email is meherun.ahmed@iub.edu.bd."
			]
		},
		{
			"tag": "AbulHasnatMSalimullah",
			"patterns": [
				"Can you tell me details about Abul Hasnat M Salimullah?",
				"Please provide information on Dr Abul Hasnat M Salimullah from Economics?"
			],
			"responses": [
				"Dr. Abul Hasnat M Salimullah is a Professor at the Department of Economics. His email is salimullah3112@iub.edu.bd."
			]
		},
		{
			"tag": "MohammadAliTaslim",
			"patterns": [
				"Can you tell me details about Mohammad Ali Taslim?",
				"Please provide information on Dr Mohammad Ali Taslim from Economics?"
			],
			"responses": [
				"Dr. Mohammad Ali Taslim is a Professor at the Department of Economics. His office is located at Room BC 4007, and his email is taslim@iub.edu.bd."
			]
		},
		{
			"tag": "MohammadShahnawazKarim",
			"patterns": [
				"Can you tell me details about Mohammad Shahnawaz Karim?",
				"Please provide information on Dr Mohammad Shahnawaz Karim from Economics?"
			],
			"responses": [
				"Dr. Mohammad Shahnawaz Karim is an Associate Professor at the Department of Economics. His office is located at Room BC 4007, and his email is mkshahnawaz@gmail.com."
			]
		},
		{
			"tag": "ShahriarKabir",
			"patterns": [
				"Can you tell me details about Shahriar Kabir?",
				"Please provide information on Dr Shahriar Kabir from Economics?"
			],
			"responses": [
				"Dr. Shahriar Kabir is an Associate Professor at the Department of Economics. His office is located at Room BC 4007, and his email is skabir@iub.edu.bd."
			]
		},
		{
			"tag": "KhwajaSaifurRahman",
			"patterns": [
				"Can you tell me details about Khwaja Saifur Rahman?",
				"Please provide information on Khwaja Saifur Rahman from Economics?"
			],
			"responses": [
				"Khwaja Saifur Rahman is a Lecturer A at the Department of Economics. His office is located at Room BC 3001, and his email is saifur2k@iub.edu.bd."
			]
		},
		{
			"tag": "MdKamrulIslam",
			"patterns": [
				"Can you tell me details about Md Kamrul Islam?",
				"Please provide information on Md Kamrul Islam from Economics?"
			],
			"responses": [
				"Md. Kamrul Islam is a Lecturer A at the Department of Economics. His office is located at Room BC 3001, and his email is kamrul@iub.edu.bd."
			]
		},
		{
			"tag": "NabilaMaruf",
			"patterns": [
				"Can you tell me details about Nabila Maruf?",
				"Please provide information on Nabila Maruf from Economics?"
			],
			"responses": [
				"Nabila Maruf is a Lecturer A at the Department of Economics. Her office is located at Room BC 3001, and her email is nabilam@iub.edu.bd."
			]
		},
		{
			"tag": "ShamilMAlIslam",
			"patterns": [
				"Can you tell me details about Shamil M Al-Islam?",
				"Please provide information on Shamil M Al-Islam from Economics?"
			],
			"responses": [
				"Shamil M Al-Islam is a Lecturer A at the Department of Economics. His office is located at Room BC 4005, and his email is shamil@iub.edu.bd."
			]
		},
		{
			"tag": "ImtiazAhmedNevin",
			"patterns": [
				"Can you tell me details about Imtiaz Ahmed Nevin?",
				"Please provide information on Dr Imtiaz Ahmed Nevin from Finance?"
			],
			"responses": [
				"Dr. Imtiaz Ahmed Nevin is an Assistant Professor and Head of the Department of Finance. His office is located at Room BC 3007, and his email is imtiaz2nevsbe@iub.edu.bd."
			]
		},
		{
			"tag": "SamiulParvezAhmed",
			"patterns": [
				"Can you tell me details about Samiul Parvez Ahmed?",
				"Please provide information on Dr Samiul Parvez Ahmed from Finance?"
			],
			"responses": [
				"Dr. Samiul Parvez Ahmed is an Associate Professor at the Department of Finance. His office is located at Room BC 4006, and his email is samiul@iub.edu.bd."
			]
		},
		{
			"tag": "MdTaslimUddin",
			"patterns": [
				"Can you tell me details about Md Taslim Uddin?",
				"Please provide information on Dr Md Taslim Uddin from Finance?"
			],
			"responses": [
				"Dr. Md Taslim Uddin is an Assistant Professor at the Department of Finance. His office is located at Room BC 4003, and his email is mtaslim@iub.edu.bd."
			]
		},
		{
			"tag": "TauhidulIslamTanin",
			"patterns": [
				"Can you tell me details about Tauhidul Islam Tanin?",
				"Please provide information on Dr Tauhidul Islam Tanin from Finance?"
			],
			"responses": [
				"Dr. Tauhidul Islam Tanin is an Assistant Professor at the Department of Finance. His email is tauhidul.tanin@iub.edu.bd."
			]
		},
		{
			"tag": "AnwarZahid",
			"patterns": [
				"Can you tell me details about Anwar Zahid?",
				"Please provide information on Anwar Zahid from Finance?"
			],
			"responses": [
				"Anwar Zahid is a Lecturer A at the Department of Finance. His office is located at Room BC 4004, and his email is anwarzahid@iub.edu.bd."
			]
		},
		{
			"tag": "MohammadFahadNoor",
			"patterns": [
				"Can you tell me details about Mohammad Fahad Noor?",
				"Please provide information on Mohammad Fahad Noor from Finance?"
			],
			"responses": [
				"Mohammad Fahad Noor is a Lecturer A at the Department of Finance. His office is located at Room BC 4005E, and his email is fahad@iub.edu.bd."
			]
		},
		{
			"tag": "MdMamunHabib",
			"patterns": [
				"Can you tell me details about Md Mamun Habib?",
				"Please provide information on Dr Md Mamun Habib from General Management?"
			],
			"responses": [
				"Dr. Md Mamun Habib is a Professor and Head of the Department of General Management. His office is located at Room BC 4007, and his email is mamunhabib@iub.edu.bd."
			]
		},
		{
			"tag": "MAMatin",
			"patterns": [
				"Can you tell me details about M A Matin?",
				"Please provide information on Dr M A Matin from General Management?"
			],
			"responses": [
				"Dr. M A Matin is a Professor at the Department of General Management. His email is matin@iub.edu.bd."
			]
		},
		{
			"tag": "AbulBashar",
			"patterns": [
				"Can you tell me details about Abul Bashar?",
				"Please provide information on Dr Abul Bashar from General Management?"
			],
			"responses": [
				"Dr. Abul Bashar is an Associate Professor at the Department of General Management. His office is located at Room BC 4008, and his email is bashar@iub.edu.bd."
			]
		},
		{
			"tag": "FarzanaChowdhury",
			"patterns": [
				"Can you tell me details about Farzana Chowdhury?",
				"Please provide information on Farzana Chowdhury from General Management?"
			],
			"responses": [
				"Farzana Chowdhury is a Lecturer A at the Department of General Management. Her office is located at Room BC 4005, and her email is fchowdhury@iub.edu.bd."
			]
		},
		{
			"tag": "IftekharMahfuz",
			"patterns": [
				"Can you tell me details about Iftekhar Mahfuz?",
				"Please provide information on Iftekhar Mahfuz from General Management?"
			],
			"responses": [
				"Iftekhar Mahfuz is a Lecturer A at the Department of General Management. His office is located at Room BC 4004, and his email is parel.iftekhar@iub.edu.bd."
			]
		},
		{
			"tag": "SeeratusSabah",
			"patterns": [
				"Can you tell me details about Seeratus Sabah?",
				"Please provide information on Seeratus Sabah from General Management?"
			],
			"responses": [
				"Seeratus Sabah is a Lecturer A at the Department of General Management. Her office is located at Room BC 4005, and her email is s.sabah@iub.edu.bd."
			]
		},
		{
			"tag": "AfnanYusuf",
			"patterns": [
				"Can you tell me details about Afnan Yusuf?",
				"Please provide information on Afnan Yusuf from General Management?"
			],
			"responses": [
				"Afnan Yusuf is a Lecturer B at the Department of General Management. His office is located at Room BC 4005 (A), and his email is afnan@iub.edu.bd."
			]
		},
		{
			"tag": "HasiburRahmanAbir",
			"patterns": [
				"Can you tell me details about Hasibur Rahman Abir?",
				"Please provide information on Hasibur Rahman Abir from General Management?"
			],
			"responses": [
				"Hasibur Rahman Abir is a Lecturer B at the Department of General Management. His office is located at Room BC 4007, and his email is hasibur@iub.edu.bd."
			]
		},
		{
			"tag": "NahidaAkhterNaiema",
			"patterns": [
				"Can you tell me details about Nahida Akhter Naiema?",
				"Please provide information on Nahida Akhter Naiema from General Management?"
			],
			"responses": [
				"Nahida Akhter Naiema is a Lecturer B at the Department of General Management. Her office is located at Room BC 4005, and her email is nahidaakhter20sbe@iub.edu.bd."
			]
		},
		{
			"tag": "IkramulHasan",
			"patterns": [
				"Can you tell me details about Ikramul Hasan?",
				"Please provide information on Dr Ikramul Hasan from Human Resource Management?"
			],
			"responses": [
				"Dr. Ikramul Hasan is an Assistant Professor and Head of the Department of Human Resource Management. His office is located at Room BC 3007, and his email is ikramul@iub.edu.bd."
			]
		},
		{
			"tag": "ShafiqulAlam",
			"patterns": [
				"Can you tell me details about Shafiqul Alam?",
				"Please provide information on Shafiqul Alam from Human Resource Management?"
			],
			"responses": [
				"Shafiqul Alam is a Lecturer A at the Department of Human Resource Management. His office is located at Room BC 3007, and his email is shafiq2014@iub.edu.bd."
			]
		},
		{
			"tag": "AbdullahAlAhad",
			"patterns": [
				"Can you tell me details about Abdullah Al Ahad?",
				"Please provide information on Abdullah Al Ahad from Human Resource Management?"
			],
			"responses": [
				"Abdullah Al Ahad is a Lecturer B at the Department of Human Resource Management. His office is located at Room BC 4009, and his email is leon077919sbe@iub.edu.bd."
			]
		},
		{
			"tag": "BushraSanjana",
			"patterns": [
				"Can you tell me details about Bushra Sanjana?",
				"Please provide information on Bushra Sanjana from Human Resource Management?"
			],
			"responses": [
				"Bushra Sanjana is a Lecturer B at the Department of Human Resource Management. Her office is located at Room BC 4009, and her email is sanjana@iub.edu.bd."
			]
		},
		{
			"tag": "EffatBinteKabir",
			"patterns": [
				"Can you tell me details about Effat Binte Kabir?",
				"Please provide information on Effat Binte Kabir from Human Resource Management?"
			],
			"responses": [
				"Effat Binte Kabir is a Lecturer B at the Department of Human Resource Management. Her email is kabireffatsbe@iub.edu.bd."
			]
		},
		{
			"tag": "NabilaKamalPromy",
			"patterns": [
				"Can you tell me details about Nabila Kamal Promy?",
				"Please provide information on Nabila Kamal Promy from Human Resource Management?"
			],
			"responses": [
				"Nabila Kamal Promy is a Lecturer B at the Department of Human Resource Management. Her email is nabilakamalsbe@iub.edu.bd."
			]
		},
		{
			"tag": "MdJosimUddin",
			"patterns": [
				"Could you please tell me details of Md Josim Uddin?",
				"Tell me information about Md Josim Uddin of Pharmacy Department?"
			],
			"responses": [
				"Md Josim Uddin is Assistant Professor and Head of the Dept. of Pharmacy, Room: BC9023A, E-mail: josim@iub.edu.bd"
			]
		},
		{
			"tag": "JMAHannan",
			"patterns": [
				"Could you please tell me details of J M A Hannan?",
				"Tell me information about J M A Hannan of Pharmacy Department?"
			],
			"responses": [
				"J M A Hannan is Professor of the Dept. of Pharmacy, Room: BC 10000, E-mail: jmahannan@iub.edu.bd"
			]
		},
		{
			"tag": "AkibBinRahman",
			"patterns": [
				"Could you please tell me details of Akib Bin Rahman?",
				"Tell me information about Akib Bin Rahman of Pharmacy Department?"
			],
			"responses": [
				"Akib Bin Rahman is Assistant Professor of the Dept. of Pharmacy, Room: BC 9023C, E-mail: akib_pharmspph@iub.edu.bd"
			]
		},
		{
			"tag": "MadhabiLataShuma",
			"patterns": [
				"Could you please tell me details of Madhabi Lata Shuma?",
				"Tell me information about Madhabi Lata Shuma of Pharmacy Department?"
			],
			"responses": [
				"Madhabi Lata Shuma is Assistant Professor of the Dept. of Pharmacy, Room: BC 10008 A, E-mail: madhabi@iub.edu.bd"
			]
		},
		{
			"tag": "MahmudaNargis",
			"patterns": [
				"Could you please tell me details of Mahmuda Nargis?",
				"Tell me information about Mahmuda Nargis of Pharmacy Department?"
			],
			"responses": [
				"Mahmuda Nargis is Assistant Professor of the Dept. of Pharmacy, Room: BC BC10023 B, E-mail: mahmuda@iub.edu.bd"
			]
		},
		{
			"tag": "NasrinAkhter",
			"patterns": [
				"Could you please tell me details of Nasrin Akhter?",
				"Tell me information about Nasrin Akhter of Pharmacy Department?"
			],
			"responses": [
				"Nasrin Akhter is Assistant Professor of the Dept. of Pharmacy, Room: BC 9023B, E-mail: nasrin.a@iub.edu.bd"
			]
		},
		{
			"tag": "SeaguftaAfrin",
			"patterns": [
				"Could you please tell me details of Seagufta Afrin?",
				"Tell me information about Seagufta Afrin of Pharmacy Department?"
			],
			"responses": [
				"Seagufta Afrin is Lecturer A of the Dept. of Pharmacy, Room: BC10018 A, E-mail: seagufta@iub.edu.bd"
			]
		},
		{
			"tag": "AminaAlamKotha",
			"patterns": [
				"Could you please tell me details of Amina Alam Kotha?",
				"Tell me information about Amina Alam Kotha of Pharmacy Department?"
			],
			"responses": [
				"Amina Alam Kotha is Lecturer B of the Dept. of Pharmacy, Room: BC BC10023 A, E-mail: kotha@iub.edu.bd"
			]
		},
		{
			"tag": "MashmumShababaShahid",
			"patterns": [
				"Could you please tell me details of Mashmum Shababa Shahid?",
				"Tell me information about Mashmum Shababa Shahid of Pharmacy Department?"
			],
			"responses": [
				"Mashmum Shababa Shahid is Lecturer B of the Dept. of Pharmacy, Room: BC 9023F, E-mail: m.shahid@iub.edu.bd"
			]
		},
		{
			"tag": "MdAbdulAziz",
			"patterns": [
				"Could you please tell me details of Md Abdul Aziz?",
				"Tell me information about Md Abdul Aziz of Pharmacy Department?"
			],
			"responses": [
				"Md Abdul Aziz is Lecturer B of the Dept. of Pharmacy, Room: BC 10023A, E-mail: abdul.aziz@iub.edu.bd"
			]
		},
		{
			"tag": "MehdiBinSamad",
			"patterns": [
				"Could you please tell me details of Mehdi Bin Samad?",
				"Tell me information about Mehdi Bin Samad of Pharmacy Department?"
			],
			"responses": [
				"Mehdi Bin Samad is Lecturer B of the Dept. of Pharmacy, Office: not specified, E-mail: mbsamad@iub.edu.bd"
			]
		},
		{
			"tag": "MohammadAbbasGani",
			"patterns": [
				"Could you please tell me details of Mohammad Abbas Gani?",
				"Tell me information about Mohammad Abbas Gani of Pharmacy Department?"
			],
			"responses": [
				"Mohammad Abbas Gani is Lecturer B of the Dept. of Pharmacy, Room: BC 9023, E-mail: abbas@iub.edu.bd"
			]
		},
		{
			"tag": "NafisaRawshan",
			"patterns": [
				"Could you please tell me details of Nafisa Rawshan?",
				"Tell me information about Nafisa Rawshan of Pharmacy Department?"
			],
			"responses": [
				"Nafisa Rawshan is Lecturer B of the Dept. of Pharmacy, Room: BC BC10018 A, E-mail: nafisa@iub.edu.bd"
			]
		},
		{
			"tag": "NaimaNusratJahan",
			"patterns": [
				"Could you please tell me details of Naima Nusrat Jahan?",
				"Tell me information about Naima Nusrat Jahan of Pharmacy Department?"
			],
			"responses": [
				"Naima Nusrat Jahan is Lecturer B of the Dept. of Pharmacy, Room: BC 9023 F, E-mail: naima@iub.edu.bd"
			]
		},
		{
			"tag": "RafiaRokaiyaHossain",
			"patterns": [
				"Could you please tell me details of Rafia Rokaiya Hossain?",
				"Tell me information about Rafia Rokaiya Hossain of Pharmacy Department?"
			],
			"responses": [
				"Rafia Rokaiya Hossain is Lecturer B of the Dept. of Pharmacy, Room: BC9023 F, E-mail: rafia@iub.edu.bd"
			]
		},
		{
			"tag": "RunaAkter",
			"patterns": [
				"Could you please tell me details of Runa Akter?",
				"Tell me information about Runa Akter of Pharmacy Department?"
			],
			"responses": [
				"Runa Akter is Lecturer B of the Dept. of Pharmacy, Room: BC10023 A, E-mail: runa@iub.edu.bd"
			]
		},
		{
			"tag": "ZenatZebinHossain",
			"patterns": [
				"Could you please tell me details of Zenat Zebin Hossain?",
				"Tell me information about Zenat Zebin Hossain of Public Health Department?"
			],
			"responses": [
				"Zenat Zebin Hossain is Assistant Professor and Head of the Dept. of Public Health, Room: BC 10010, E-mail: zenat@iub.edu.bd"
			]
		},
		{
			"tag": "KamranulBaset",
			"patterns": [
				"Could you please tell me details of Kamran ul Baset?",
				"Tell me information about Kamran ul Baset of Public Health Department?"
			],
			"responses": [
				"Kamran ul Baset is Associate Professor of the Dept. of Public Health, Room: BC 10011, E-mail: kamranspph@iub.edu.bd"
			]
		},
		{
			"tag": "NafisaHuq",
			"patterns": [
				"Could you please tell me details of Nafisa Huq?",
				"Tell me information about Nafisa Huq of Public Health Department?"
			],
			"responses": [
				"Nafisa Huq is Assistant Professor of the Dept. of Public Health, Room: BC 10010, E-mail: nafisahuq@iub.edu.bd"
			]
		},
		{
			"tag": "SMRaysulHaque",
			"patterns": [
				"Could you please tell me details of S M Raysul Haque?",
				"Tell me information about S M Raysul Haque of Public Health Department?"
			],
			"responses": [
				"S M Raysul Haque is Assistant Professor of the Dept. of Public Health, Room: BC 10011, E-mail: raysul.haque@iub.edu.bd"
			]
		},
		{
			"tag": "MdRabiulIslam",
			"patterns": [
				"Could you please tell me details of Md Rabiul Islam?",
				"Tell me information about Md Rabiul Islam of Public Health Department?"
			],
			"responses": [
				"Md Rabiul Islam is Lecturer A of the Dept. of Public Health, Room: BC 10008, E-mail: rabiul@iub.edu.bd"
			]
		},
		{
			"tag": "ShabareenTisha",
			"patterns": [
				"Could you please tell me details of Shabareen Tisha?",
				"Tell me information about Shabareen Tisha of Public Health Department?"
			],
			"responses": [
				"Shabareen Tisha is Lecturer A of the Dept. of Public Health, Room: BC 10008 (D), E-mail: shabareen.tisha@iub.edu.bd"
			]
		},
		{
			"tag": "TasnuvaFaruk",
			"patterns": [
				"Could you please tell me details of Tasnuva Faruk?",
				"Tell me information about Tasnuva Faruk of Public Health Department?"
			],
			"responses": [
				"Tasnuva Faruk is Lecturer A of the Dept. of Public Health, Room: BC 10008B, E-mail: tasnuva.faruk@iub.edu.bd"
			]
		},
		{
			"tag": "MuhammadMahbuburRahman",
			"patterns": [
				"Could you please tell me details of Muhammad Mahbubur Rahman?",
				"Tell me information about Muhammad Mahbubur Rahman of Law Department?"
			],
			"responses": [
				"Muhammad Mahbubur Rahman is Professor and Head of the Dept. of Law, E-mail: mahbubur@iub.edu.bd"
			]
		},
		{
			"tag": "MohammadNazmuzzamanBhuian",
			"patterns": [
				"Could you please tell me details of Mohammad Nazmuzzaman Bhuian?",
				"Tell me information about Mohammad Nazmuzzaman Bhuian of Law Department?"
			],
			"responses": [
				"Mohammad Nazmuzzaman Bhuian is Professor of the Dept. of Law, E-mail: mnb@iub.edu.bd"
			]
		},
		{
			"tag": "AssaduzzamanKhan",
			"patterns": [
				"Could you please tell me details of Assaduzzaman Khan?",
				"Tell me information about Assaduzzaman Khan of Law Department?"
			],
			"responses": [
				"Assaduzzaman Khan is Professor of the Dept. of Law, Room: C 8012, E-mail: assadng@iub.edu.bd"
			]
		},
		{
			"tag": "BorhanUddinKhan",
			"patterns": [
				"Could you please tell me details of Borhan Uddin Khan?",
				"Tell me information about Borhan Uddin Khan of Law Department?"
			],
			"responses": [
				"Borhan Uddin Khan is Professor of the Dept. of Law, Room: C 9007, E-mail: borhan@iub.edu.bd"
			]
		},
		{
			"tag": "MdAbdulAwalKhan",
			"patterns": [
				"Could you please tell me details of Md Abdul Awal Khan?",
				"Tell me information about Md Abdul Awal Khan of Law Department?"
			],
			"responses": [
				"Md Abdul Awal Khan is Professor of the Dept. of Law, Room: C 8011, E-mail: awalkhanlaw@iub.edu.bd"
			]
		},
		{
			"tag": "AnisurRahman",
			"patterns": [
				"Could you please tell me details of Anisur Rahman?",
				"Tell me information about Anisur Rahman of Law Department?"
			],
			"responses": [
				"Anisur Rahman is Associate Professor of the Dept. of Law, Room: BC 9005, E-mail: anisur@iub.edu.bd"
			]
		},
		{
			"tag": "MdJahidHossainBhuiyan",
			"patterns": [
				"Could you please tell me details of Md Jahid Hossain Bhuiyan?",
				"Tell me information about Md Jahid Hossain Bhuiyan of Law Department?"
			],
			"responses": [
				"Md Jahid Hossain Bhuiyan is Associate Professor of the Dept. of Law, Room: C 8015, E-mail: jahid@iub.edu.bd"
			]
		},
		{
			"tag": "HassanFarukAlImran",
			"patterns": [
				"Could you please tell me details of Hassan Faruk Al Imran?",
				"Tell me information about Hassan Faruk Al Imran of Law Department?"
			],
			"responses": [
				"Hassan Faruk Al Imran is Assistant Professor of the Dept. of Law, Room: BC 8013, E-mail: hassan.alimran@iub.edu.bd"
			]
		},
		{
			"tag": "MdMonjurHasan",
			"patterns": [
				"Could you please tell me details of Md. Monjur Hasan?",
				"Tell me information about Md. Monjur Hasan of Law Department?"
			],
			"responses": [
				"Md. Monjur Hasan is Assistant Professor of the Dept. of Law, Room: MK 6004 (B), E-mail: hasan@iub.edu.bd"
			]
		},
		{
			"tag": "MdToriqulIslam",
			"patterns": [
				"Could you please tell me details of Md. Toriqul Islam?",
				"Tell me information about Md. Toriqul Islam of Law Department?"
			],
			"responses": [
				"Md. Toriqul Islam is Assistant Professor of the Dept. of Law, Room: MK 6004 (A), E-mail: toriqul@iub.edu.bd"
			]
		},
		{
			"tag": "ZahidulIslam",
			"patterns": [
				"Could you please tell me details of Zahidul Islam?",
				"Tell me information about Zahidul Islam of Law Department?"
			],
			"responses": [
				"Zahidul Islam is Assistant Professor of the Dept. of Law, Room: C 8003, E-mail: zahidul@iub.edu.bd"
			]
		},
		{
			"tag": "LitonChandraBiswas",
			"patterns": [
				"Could you please tell me details of Liton Chandra Biswas?",
				"Tell me information about Liton Chandra Biswas of Law Department?"
			],
			"responses": [
				"Liton Chandra Biswas is Assistant Professor of the Dept. of Law, Room: C C8004, E-mail: lcb@iub.edu.bd"
			]
		},
		{
			"tag": "AfrozaBilkis",
			"patterns": [
				"Could you please tell me details of Afroza Bilkis?",
				"Tell me information about Afroza Bilkis of Law Department?"
			],
			"responses": [
				"Afroza Bilkis is Lecturer A of the Dept. of Law, Room: C 9011, E-mail: afroza.bilkis@iub.edu.bd"
			]
		},
		{
			"tag": "MdAlIfranHossainMollah",
			"patterns": [
				"Could you please tell me details of Md Al Ifran Hossain Mollah?",
				"Tell me information about Md Al Ifran Hossain Mollah of Law Department?"
			],
			"responses": [
				"Md Al Ifran Hossain Mollah is Lecturer A of the Dept. of Law, Room: C 9008, E-mail: ifran@iub.edu.bd"
			]
		},
		{
			"tag": "RehnumaBinteMamun",
			"patterns": [
				"Could you please tell me details of Rehnuma Binte Mamun?",
				"Tell me information about Rehnuma Binte Mamun of Law Department?"
			],
			"responses": [
				"Rehnuma Binte Mamun is Lecturer A of the Dept. of Law, Room: C, E-mail: rehnuma@iub.edu.bd"
			]
		},
		{
			"tag": "TariqBinSarwar",
			"patterns": [
				"Could you please tell me details of Tariq Bin Sarwar?",
				"Tell me information about Tariq Bin Sarwar of Law Department?"
			],
			"responses": [
				"Tariq Bin Sarwar is Lecturer A of the Dept. of Law, Room: C 8014, E-mail: tariqsarwar.law@iub.edu.bd"
			]
		},
		{
			"tag": "WashikMuhammodIstiaqEzaz",
			"patterns": [
				"Could you please tell me details of Washik Muhammod Istiaq Ezaz?",
				"Tell me information about Washik Muhammod Istiaq Ezaz of Law Department?"
			],
			"responses": [
				"Washik Muhammod Istiaq Ezaz is Lecturer A of the Dept. of Law, Room: C C9008, E-mail: washik@iub.edu.bd"
			]
		},
		{
			"tag": "MaimunaSyedAhmed",
			"patterns": [
				"Could you please tell me details of Maimuna Syed Ahmed?",
				"Tell me information about Maimuna Syed Ahmed of Law Department?"
			],
			"responses": [
				"Maimuna Syed Ahmed is Lecturer B of the Dept. of Law, Room: C, E-mail: maimuna.mk94slass@iub.edu.bd"
			]
		},
		{
			"tag": "MdHafizurRahman",
			"patterns": [
				"Could you please tell me details of Md Hafizur Rahman?",
				"Tell me information about Md Hafizur Rahman of ESM Department?"
			],
			"responses": [
				"Md Hafizur Rahman is Associate Professor and Head of the Dept. of ESM, Room: BC 9000, E-mail: hrahman@iub.edu.bd"
			]
		},
		{
			"tag": "MdAbdulKhaleque",
			"patterns": [
				"Could you please tell me details of Md Abdul Khaleque?",
				"Tell me information about Md Abdul Khaleque of ESM Department?"
			],
			"responses": [
				"Md Abdul Khaleque is Professor of the Dept. of ESM, Room: BC 9005, E-mail: akhaleque@iub.edu.bd"
			]
		},
		{
			"tag": "KAyazRabbani",
			"patterns": [
				"Could you please tell me details of K Ayaz Rabbani?",
				"Tell me information about K Ayaz Rabbani of ESM Department?"
			],
			"responses": [
				"K Ayaz Rabbani is Associate Professor of the Dept. of ESM, Room: BC 9012, E-mail: rabbani@iub.edu.bd"
			]
		},
		{
			"tag": "MohammadSorowarHossain",
			"patterns": [
				"Could you please tell me details of Mohammad Sorowar Hossain?",
				"Tell me information about Mohammad Sorowar Hossain of ESM Department?"
			],
			"responses": [
				"Mohammad Sorowar Hossain is Associate Professor of the Dept. of ESM, Room: BC 9008, E-mail: sorowar.hossain@iub.edu.bd"
			]
		},
		{
			"tag": "RumanaSultana",
			"patterns": [
				"Could you please tell me details of Rumana Sultana?",
				"Tell me information about Rumana Sultana of ESM Department?"
			],
			"responses": [
				"Rumana Sultana is Assistant Professor of the Dept. of ESM, Room: BC 9010A, E-mail: rumana.sultana@iub.edu.bd"
			]
		},
		{
			"tag": "SadiaNazneenKarobi",
			"patterns": [
				"Could you please tell me details of Sadia Nazneen Karobi?",
				"Tell me information about Sadia Nazneen Karobi of ESM Department?"
			],
			"responses": [
				"Sadia Nazneen Karobi is Assistant Professor of the Dept. of ESM, Room: BC 9010, E-mail: snkarobi@iub.edu.bd"
			]
		},
		{
			"tag": "TawhidMonzur",
			"patterns": [
				"Could you please tell me details of Tawhid Monzur?",
				"Tell me information about Tawhid Monzur of ESM Department?"
			],
			"responses": [
				"Tawhid Monzur is Assistant Professor of the Dept. of ESM, Room: BC 9007B, E-mail: tawhmo18@iub.edu.bd"
			]
		},
		{
			"tag": "KaziSunzidaLisa",
			"patterns": [
				"Could you please tell me details of Kazi Sunzida Lisa?",
				"Tell me information about Kazi Sunzida Lisa of ESM Department?"
			],
			"responses": [
				"Kazi Sunzida Lisa is Lecturer A of the Dept. of ESM, Room: BC 9009B, E-mail: sunzida@iub.edu.bd"
			]
		},
		{
			"tag": "MdEkhtekharulIslam",
			"patterns": [
				"Could you please tell me details of Md Ekhtekharul Islam?",
				"Tell me information about Md Ekhtekharul Islam of ESM Department?"
			],
			"responses": [
				"Md Ekhtekharul Islam is Lecturer A of the Dept. of ESM, Room: BC 9006, E-mail: ekhtekhar@iub.edu.bd"
			]
		},
		{
			"tag": "MohammadAbdulBaten",
			"patterns": [
				"Could you please tell me details of Mohammad Abdul Baten?",
				"Tell me information about Mohammad Abdul Baten of ESM Department?"
			],
			"responses": [
				"Mohammad Abdul Baten is Lecturer A of the Dept. of ESM, E-mail: a.baten@iub.edu.bd"
			]
		},
		{
			"tag": "SaquibAhmadKhan",
			"patterns": [
				"Could you please tell me details of Saquib Ahmad Khan?",
				"Tell me information about Saquib Ahmad Khan of ESM Department?"
			],
			"responses": [
				"Saquib Ahmad Khan is Lecturer A of the Dept. of ESM, Room: BC 9006C, E-mail: saquib@iub.edu.bd"
			]
		},
		{
			"tag": "TanvirAhmedHaroon",
			"patterns": [
				"Could you please tell me details of Tanvir Ahmed Haroon?",
				"Tell me information about Tanvir Ahmed Haroon of ESM Department?"
			],
			"responses": [
				"Tanvir Ahmed Haroon is Lecturer A of the Dept. of ESM, Room: BC, E-mail: taharoon@iub.edu.bd"
			]
		},
		{
			"tag": "KarishmaSinha",
			"patterns": [
				"Could you please tell me details of Karishma Sinha?",
				"Tell me information about Karishma Sinha of ESM Department?"
			],
			"responses": [
				"Karishma Sinha is Lecturer B of the Dept. of ESM, Room: BC 9009A, E-mail: karishma@iub.edu.bd"
			]
		},
		{
			"tag": "NabilaRahman",
			"patterns": [
				"Could you please tell me details of Nabila Rahman?",
				"Tell me information about Nabila Rahman of ESM Department?"
			],
			"responses": [
				"Nabila Rahman is Lecturer B of the Dept. of ESM, E-mail: nabila.rahman@iub.edu.bd"
			]
		},
		{
			"tag": "TahminaSultana",
			"patterns": [
				"Could you please tell me details of Tahmina Sultana?",
				"Tell me information about Tahmina Sultana of ESM Department?"
			],
			"responses": [
				"Tahmina Sultana is Lecturer B of the Dept. of ESM, Room: BC 9009B, E-mail: tahmina@iub.edu.bd"
			]
		},
		{
			"tag": "AshrafusSafa",
			"patterns": [
				"Could you please tell me details of Ashrafus Safa?",
				"Tell me information about Ashrafus Safa of Life Sciences Department?"
			],
			"responses": [
				"Ashrafus Safa is Associate Professor and Head of the Dept. of Life Sciences, Room: BC 10013A, E-mail: asafa@iub.edu.bd"
			]
		},
		{
			"tag": "ShahMFaruque",
			"patterns": [
				"Could you please tell me details of Shah M Faruque?",
				"Tell me information about Shah M Faruque of Life Sciences Department?"
			],
			"responses": [
				"Shah M Faruque is Professor of the Dept. of Life Sciences, Room: BC 10002D, E-mail: shah.faruque@iub.edu.bd"
			]
		},
		{
			"tag": "MdMahmodulHasanSohel",
			"patterns": [
				"Could you please tell me details of Md Mahmodul Hasan Sohel?",
				"Tell me information about Md Mahmodul Hasan Sohel of Life Sciences Department?"
			],
			"responses": [
				"Md Mahmodul Hasan Sohel is Associate Professor of the Dept. of Life Sciences, Room: BC 10013, E-mail: mmhs@iub.edu.bd"
			]
		},
		{
			"tag": "FahmidaAlam",
			"patterns": [
				"Could you please tell me details of Fahmida Alam?",
				"Tell me information about Fahmida Alam of Life Sciences Department?"
			],
			"responses": [
				"Fahmida Alam is Assistant Professor of the Dept. of Life Sciences, Room: C 8008, E-mail: fahmida.alam@iub.edu.bd"
			]
		},
		{
			"tag": "JannatulFerdous",
			"patterns": [
				"Could you please tell me details of Jannatul Ferdous?",
				"Tell me information about Jannatul Ferdous of Life Sciences Department?"
			],
			"responses": [
				"Jannatul Ferdous is Assistant Professor of the Dept. of Life Sciences, Room: BC 10012, E-mail: jannatul@iub.edu.bd"
			]
		},
		{
			"tag": "JebunnaharKhandakar",
			"patterns": [
				"Could you please tell me details of Jebunnahar Khandakar?",
				"Tell me information about Jebunnahar Khandakar of Life Sciences Department?"
			],
			"responses": [
				"Jebunnahar Khandakar is Assistant Professor of the Dept. of Life Sciences, Room: BC 10012B, E-mail: dr.khandakar@iub.edu.bd"
			]
		},
		{
			"tag": "MdAhsanUlBari",
			"patterns": [
				"Could you please tell me details of Md Ahsan Ul Bari?",
				"Tell me information about Md Ahsan Ul Bari of Life Sciences Department?"
			],
			"responses": [
				"Md Ahsan Ul Bari is Assistant Professor of the Dept. of Life Sciences, Room: BC 10007A, E-mail: ahsan@iub.edu.bd"
			]
		},
		{
			"tag": "SabrinaMoriomElias",
			"patterns": [
				"Could you please tell me details of Sabrina Moriom Elias?",
				"Tell me information about Sabrina Moriom Elias of Life Sciences Department?"
			],
			"responses": [
				"Sabrina Moriom Elias is Assistant Professor of the Dept. of Life Sciences, Room: C 8007, E-mail: sabrina.elias@iub.edu.bd"
			]
		},
		{
			"tag": "MarizSintaha",
			"patterns": [
				"Could you please tell me details of Mariz Sintaha?",
				"Tell me information about Mariz Sintaha of Life Sciences Department?"
			],
			"responses": [
				"Mariz Sintaha is Lecturer A of the Dept. of Life Sciences, Room: BC 10007, E-mail: m.sintaha@iub.edu.bd"
			]
		},
		{
			"tag": "ABMRezwanulKabir",
			"patterns": [
				"Could you please tell me details of A B M Rezwanul Kabir?",
				"Tell me information about A B M Rezwanul Kabir of Life Sciences Department?"
			],
			"responses": [
				"A B M Rezwanul Kabir is Lecturer B of the Dept. of Life Sciences, Room: BC 10007, E-mail: rezwanul.kabir@iub.edu.bd"
			]
		},
		{
			"tag": "AfiaNowshen",
			"patterns": [
				"Could you please tell me details of Afia Nowshen?",
				"Tell me information about Afia Nowshen of Life Sciences Department?"
			],
			"responses": [
				"Afia Nowshen is Lecturer B of the Dept. of Life Sciences, Room: BC 10007, E-mail: afia@iub.edu.bd"
			]
		},
		{
			"tag": "ArkaRoy",
			"patterns": [
				"Could you please tell me details of Arka Roy?",
				"Tell me information about Arka Roy of Life Sciences Department?"
			],
			"responses": [
				"Arka Roy is Lecturer B of the Dept. of Life Sciences, Room: BC 1007C, E-mail: arka@iub.edu.bd"
			]
		},
		{
			"tag": "NazratunNayeemChoudhury",
			"patterns": [
				"Could you please tell me details of Nazratun Nayeem Choudhury?",
				"Tell me information about Nazratun Nayeem Choudhury of Life Sciences Department?"
			],
			"responses": [
				"Nazratun Nayeem Choudhury is Lecturer B of the Dept. of Life Sciences, Room: BC 10007, E-mail: naznatun@iub.edu.bd"
			]
		},
		{
			"tag": "NowshinTarannum",
			"patterns": [
				"Could you please tell me details of Nowshin Tarannum?",
				"Tell me information about Nowshin Tarannum of Life Sciences Department?"
			],
			"responses": [
				"Nowshin Tarannum is Lecturer B of the Dept. of Life Sciences, Room: BC 10007, E-mail: nowshin@iub.edu.bd"
			]
		},
		{
			"tag": "TasnimulFerdous",
			"patterns": [
				"Could you please tell me details of Tasnimul Ferdous?",
				"Tell me information about Tasnimul Ferdous of Life Sciences Department?"
			],
			"responses": [
				"Tasnimul Ferdous is Lecturer B of the Dept. of Life Sciences, Room: BC 10007D, E-mail: shammo.tasnim@iub.edu.bd"
			]
		},
		{
			"tag": "SMSohelRana",
			"patterns": [
				"Could you please tell me details of S M Sohel Rana?",
				"Tell me information about S M Sohel Rana of Marketing Department?"
			],
			"responses": [
				"S M Sohel Rana is Associate Professor and Head of the Dept. of Marketing, Room: BC 3006, E-mail: sohelrana@iub.edu.bd"
			]
		},
		{
			"tag": "RafiuddinAhmed",
			"patterns": [
				"Could you please tell me details of Rafiuddin Ahmed?",
				"Tell me information about Rafiuddin Ahmed of Marketing Department?"
			],
			"responses": [
				"Rafiuddin Ahmed is Professor of the Dept. of Marketing, Room: BC 3006, E-mail: rafiuddin@iub.edu.bd"
			]
		},
		{
			"tag": "AbulKhairJyote",
			"patterns": [
				"Could you please tell me details of Abul Khair Jyote?",
				"Tell me information about Abul Khair Jyote of Marketing Department?"
			],
			"responses": [
				"Abul Khair Jyote is Lecturer A of the Dept. of Marketing, Room: BC 3006, E-mail: akj.iub@iub.edu.bd"
			]
		},
		{
			"tag": "MohammedSohelIslam",
			"patterns": [
				"Could you please tell me details of Mohammed Sohel Islam?",
				"Tell me information about Mohammed Sohel Islam of Marketing Department?"
			],
			"responses": [
				"Mohammed Sohel Islam is Lecturer A of the Dept. of Marketing, Room: BC 4009C, E-mail: sohelislam@iub.edu.bd"
			]
		},
		{
			"tag": "SheikhMohammadFauzulAzim",
			"patterns": [
				"Could you please tell me details of Sheikh Mohammad Fauzul Azim?",
				"Tell me information about Sheikh Mohammad Fauzul Azim of Marketing Department?"
			],
			"responses": [
				"Sheikh Mohammad Fauzul Azim is Lecturer A of the Dept. of Marketing, Room: BC 3007, E-mail: azim2705@iub.edu.bd"
			]
		},
		{
			"tag": "SumanProsadSaha",
			"patterns": [
				"Could you please tell me details of Suman Prosad Saha?",
				"Tell me information about Suman Prosad Saha of Marketing Department?"
			],
			"responses": [
				"Suman Prosad Saha is Lecturer A of the Dept. of Marketing, Room: BC 3006, E-mail: suman.saha@iub.edu.bd"
			]
		},
		{
			"tag": "ZakiaBinteJamal",
			"patterns": [
				"Could you please tell me details of Zakia Binte Jamal?",
				"Tell me information about Zakia Binte Jamal of Marketing Department?"
			],
			"responses": [
				"Zakia Binte Jamal is Lecturer A of the Dept. of Marketing, Room: BC 4009, E-mail: zakia@iub.edu.bd"
			]
		},
		{
			"tag": "MdAzzajurRahman",
			"patterns": [
				"Could you please tell me details of Md Azzajur Rahman?",
				"Tell me information about Md Azzajur Rahman of Marketing Department?"
			],
			"responses": [
				"Md Azzajur Rahman is Lecturer B of the Dept. of Marketing, Room: BC 4007-B, E-mail: azzajur@iub.edu.bd"
			]
		},
		{
			"tag": "NahinSultana",
			"patterns": [
				"Could you please tell me details of Nahin Sultana?",
				"Tell me information about Nahin Sultana of Marketing Department?"
			],
			"responses": [
				"Nahin Sultana is Lecturer B of the Dept. of Marketing, Room: BC 3007, E-mail: nahin@iub.edu.bd"
			]
		},
		{
			"tag": "NushratJahan",
			"patterns": [
				"Could you please tell me details of Nushrat Jahan?",
				"Tell me information about Nushrat Jahan of MIS Department?"
			],
			"responses": [
				"Nushrat Jahan is Assistant Professor and Head of the Dept. of MIS, Room: BC 4009A, E-mail: mis_head@iub.edu.bd"
			]
		},
		{
			"tag": "RezwanulAlam",
			"patterns": [
				"Could you please tell me details of Rezwanul Alam?",
				"Tell me information about Rezwanul Alam of MIS Department?"
			],
			"responses": [
				"Rezwanul Alam is Associate Professor of the Dept. of MIS, Room: BC 4003A, E-mail: rezwan@iub.edu.bd"
			]
		},
		{
			"tag": "ArifurRahmanKhan",
			"patterns": [
				"Could you please tell me details of Arifur Rahman Khan?",
				"Tell me information about Arifur Rahman Khan of MIS Department?"
			],
			"responses": [
				"Arifur Rahman Khan is Lecturer A of the Dept. of MIS, Room: BC 2007, E-mail: arifur.rahman@iub.edu.bd"
			]
		},
		{
			"tag": "MdAminulIslam",
			"patterns": [
				"Could you please tell me details of Md Aminul Islam?",
				"Tell me information about Md Aminul Islam of MIS Department?"
			],
			"responses": [
				"Md. Aminul Islam is Lecturer A of the Dept. of MIS, Room: BC 4007 B, E-mail: islam@iub.edu.bd"
			]
		},
		{
			"tag": "SafayetRahman",
			"patterns": [
				"Could you please tell me details of Safayet Rahman?",
				"Tell me information about Safayet Rahman of IB Department?"
			],
			"responses": [
				"Safayet Rahman is Assistant Professor and Head of the Dept. of IB, Room: BC 2008 - B, E-mail: safayet.rahman@iub.edu.bd"
			]
		},
		{
			"tag": "NazrulIslam",
			"patterns": [
				"Could you please tell me details of Nazrul Islam?",
				"Tell me information about Nazrul Islam of IB Department?"
			],
			"responses": [
				"Nazrul Islam is Professor of the Dept. of IB, Room: BC, E-mail: nazrul@iub.edu.bd"
			]
		},
		{
			"tag": "RaisulAwalMahmood",
			"patterns": [
				"Could you please tell me details of Raisul Awal Mahmood?",
				"Tell me information about Raisul Awal Mahmood of IB Department?"
			],
			"responses": [
				"Raisul Awal Mahmood is Professor of the Dept. of IB, Room: BC 2007, E-mail: raisul@iub.edu.bd"
			]
		},
		{
			"tag": "HanifMahtab",
			"patterns": [
				"Could you please tell me details of Hanif Mahtab?",
				"Tell me information about Hanif Mahtab of IB Department?"
			],
			"responses": [
				"Hanif Mahtab is Assistant Professor of the Dept. of IB, Room: BC 2008A, E-mail: hanif@iub.edu.bd"
			]
		},
		{
			"tag": "SMYusufMallick",
			"patterns": [
				"Could you please tell me details of S. M. Yusuf Mallick?",
				"Tell me information about S. M. Yusuf Mallick of IB Department?"
			],
			"responses": [
				"S. M. Yusuf Mallick is Lecturer B of the Dept. of IB, Room: BC 4004, E-mail: ymallick@iub.edu.bd"
			]
		},
		{
			"tag": "TarannumAzim",
			"patterns": [
				"Could you please tell me details of Tarannum Azim?",
				"Tell me information about Tarannum Azim of IB Department?"
			],
			"responses": [
				"Tarannum Azim is Lecturer B of the Dept. of IB, Room: BC 3007, E-mail: tarannum.azim@iub.edu.bd"
			]
		},
		{
			"tag": "departmentheadofaccounting",
			"patterns": [
				"Who is the department head of accounting Department?",
				"What is the name of the department head of accounting Department?"
			],
			"responses": [
				"Dr. Maqbool Kader Quraishi"
			]
		},
		{
			"tag": "departmentheadoffecnomics",
			"patterns": [
				"Who is the department head of ecnomics Department?",
				"What is the name of the department head of ecnomics Department?"
			],
			"responses": [
				"Dr. Md Khaled Saifullah"
			]
		},
		{
			"tag": "departmentheadoffinance",
			"patterns": [
				"Who is the department head of finance Department?",
				"What is the name of the department head of finance Department?"
			],
			"responses": [
				"Dr. Imtiaz Ahmed Nevin"
			]
		},
		{
			"tag": "departmentheadofmanagement",
			"patterns": [
				"Who is the department head of management Department?",
				"What is the name of the department head of General Management Department?"
			],
			"responses": [
				"Dr. Md Mamun Habib"
			]
		},
		{
			"tag": "departmentheadofhr",
			"patterns": [
				"Who is the department head of hr Department?",
				"What is the name of the department head of Human Resource Management Department?"
			],
			"responses": [
				"Dr. Ikramul Hasan"
			]
		},
		{
			"tag": "departmentheadofinternationalbusiness",
			"patterns": [
				"Who is the department head of International Business Department?",
				"What is the name of the department head of International Business Department?"
			],
			"responses": [
				"Dr. Safayet Rahman"
			]
		},
		{
			"tag": "departmentheadofinformation_systems",
			"patterns": [
				"Who is the department head of Information Systems Department?",
				"What is the name of the department head of Management Information Systems?"
			],
			"responses": [
				"Dr. Nushrat Jahan"
			]
		},
		{
			"tag": "departmentheadofMarketing",
			"patterns": [
				"Who is the department head of Marketing Department?",
				"What is the name of the department head of Marketing Systems?"
			],
			"responses": [
				"Dr. S M Sohel Rana"
			]
		},
		{
			"tag": "departmentheadofEEE",
			"patterns": [
				"Who is the department head of EEE Department?",
				"Who is the department head of Electrical and Electronic Engineering Department?",
				"What is the name of the department head of Electrical and Electronic Engineering?"
			],
			"responses": [
				"Dr. Mustafa Habib Chowdhury"
			]
		},
		{
			"tag": "departmentheadofpharmacy",
			"patterns": [
				"Who is the department head of Pharmacy department?",
				"What is the name of the department head of Pharmacy Department?"
			],
			"responses": [
				"Dr. Md Josim Uddinm"
			]
		},
		{
			"tag": "departmentheadofpublichealth",
			"patterns": [
				"Who is the department head of PH department?",
				"Who is the department head of Public Health department?",
				"What is the name of the department head of Public Health Department?"
			],
			"responses": [
				"Dr. Zenat Zebin Hossain"
			]
		},
		{
			"tag": "departmentheadofenglish",
			"patterns": [
				"Who is the department head of English department?",
				"Who is the department head of English and Modern Languages department?",
				"What is the name of the department head of English and Modern Languages Department?"
			],
			"responses": [
				"Dr. Naureen Rahnuma"
			]
		},
		{
			"tag": "departmentheadofglobalstudies",
			"patterns": [
				"Who is the department head of GSG department?",
				"Who is the department head of Global Studies and Governance department?",
				"What is the name of the department head of Global Studies and Governance Department?"
			],
			"responses": [
				"Dr. Marufa Akter"
			]
		},
		{
			"tag": "departmentheadofsocialsciences_humanities",
			"patterns": [
				"Who is the department head of SSH department?",
				"Who is the department head of Social Science department?",
				"Who is the department head of Humanities department?",
				"Who is the department head of Social Sciences and Humanities department?",
				"What is the name of the department head of Social Sciences and Humanities Department?"
			],
			"responses": [
				"Dr. Kazi Mahmudur Rahman"
			]
		},
		{
			"tag": "departmentheadoflaw",
			"patterns": [
				"Who is the department head of Law department?",
				"What is the name of the department head of Law Department?"
			],
			"responses": [
				"Dr. Muhammad Mahbubur Rahman"
			]
		},
		{
			"tag": "departmentheadoflifesciences",
			"patterns": [
				"Who is the department head of LS department?",
				"Who is the department head of Life Sciences department?",
				"What is the name of the department head of Life Sciences Department?"
			],
			"responses": [
				"Dr. Ashrafus Safa"
			]
		},
		{
			"tag": "departmentheadofenv",
			"patterns": [
				"Who is the department head of ENV department?",
				"Who is the department head of Environmental Science and Management department?",
				"What is the name of the department head of Environmental Science and Management Department?"
			],
			"responses": [
				"Dr. Ashrafus Safa"
			]
		},
		{
			"tag": "departmentheadofphysics",
			"patterns": [
				"Who is the department head of PS department?",
				"Who is the department head of Physical Sciences department?",
				"What is the name of the department head of Physical Sciences Department?"
			],
			"responses": [
				"Dr. Farhad Alam"
			]
		},
		{
			"tag": "Scholarship",
			"patterns": [
				"tell me about scholarship details"
			],
			"responses": [
				"IUB provides financial assistance through Merit Scholarships, Financial Aid, and Tuition Fee Discounts, allowing students to receive only one type at a time, selecting the higher value. Merit Scholarships offer tuition waivers of 30% to 100% based on test results and academic performance. Financial Aid includes need-based support and assistance for the children of Freedom Fighters. Tuition Fee Discounts apply to various categories, such as extra-curricular activities and economically disadvantaged students, with waivers up to 100%. Students must maintain a minimum CGPA and credit hours to remain eligible. Required documentation includes financial statements and academic transcripts. For specifics, students should consult the official IUB guidelines."
			]
		},
		{
			"tag": "opentoday",
			"patterns": [
				"Are you open today?",
				"When do you open today?",
				"What are your hours today?"
			],
			"responses": [
				"We're open every day from 8.00am-9.00pm except Friday",
				"Our hours are 8.00am-5.00pm except Friday"
			]
		},
		{
			"tag": "faculty",
			"patterns": [
				"How many faculty members in iub?",
				"Tell me the number of faculty member in iub?",
				" What is the total faculty number of iub?"
			],
			"responses": [
				"450 Faculty Members in total",
				" 450",
				"about 450 faculty Members"
			]
		},
		{
			"tag": "facultyPHD",
			"patterns": [
				"How many faculty have PHD degree?",
				" Tell me how many faculty have the PHD degree?",
				"Number of PHD Faculty"
			],
			"responses": [
				"283",
				"283 faculty have the PHD degree"
			]
		},
		{
			"tag": "fulltimeFaculty",
			"patterns": [
				"How many faculty work for full time?",
				"Number of full time faculty"
			],
			"responses": [
				"242"
			]
		},
		{
			"tag": "halftimeFaculty",
			"patterns": [
				"How many faculty work for half time?",
				"Number of half time faculty"
			],
			"responses": [
				"19",
				"Only 19 faculty"
			]
		},
		{
			"tag": "malestudents",
			"patterns": [
				"How many male students are in iub?",
				"Number of male students"
			],
			"responses": [
				"5665",
				"About 5665 students are male in iub"
			]
		},
		{
			"tag": "femalestudents",
			"patterns": [
				"How many female students are in iub?",
				"Number of female students"
			],
			"responses": [
				"2732",
				"About 2732 students are female in iub"
			]
		},
		{
			"tag": "students",
			"patterns": [
				"How many students are in iub?",
				"Number of total students",
				"Total number of students in iub campus"
			],
			"responses": [
				"8397",
				"Total students are 8397"
			]
		},
		{
			"tag": "internationaltudents",
			"patterns": [
				"How many international students are in iub?",
				"Number of international students"
			],
			"responses": [
				"68",
				"About 68 students are international students in iub",
				"Overall international students are 68 in total"
			]
		},
		{
			"tag": "internationalundergraduatestudents",
			"patterns": [
				"How many international undergraduate students are in iub?",
				"Number of international undergraduate students"
			],
			"responses": [
				"62",
				"About 62 students are international undergraduate students in iub",
				"Overall international undergraduate students            are 62 in total"
			]
		},
		{
			"tag": "undergraduatestudents",
			"patterns": [
				"How many undergraduate students are in iub?",
				"Number of undergraduate students"
			],
			"responses": [
				"8236",
				"About 8236 students are undergraduate in iub",
				"Overall undergraduate students are 8236 in total"
			]
		},
		{
			"tag": "departments",
			"patterns": [
				"How many departments are in iub?",
				"Number of departments",
				"Total number of department in iub campus"
			],
			"responses": [
				"10",
				"Total departments are 10"
			]
		},
		{
			"tag": "cse",
			"patterns": [
				"Tell me the details for CSE Program?",
				"Tell me the details for BCSE Program?",
				"I want to know Bachelor of Computer Science           and Engineering Program?",
				"CSE Program",
				"CSE Details"
			],
			"responses": [
				"BCSE full form- Bachelor of Computer Science and Engineering, Time duration- 4 years,12 semesters,143 credit hours,TK 6,822          /- per semester (approx. without scholarship)"
			]
		},
		{
			"tag": "insults_english",
			"patterns": [
				"motherfucker",
				"fuck",
				"shit",
				"asshole",
				"bitch",
				"bastard",
				"dickhead",
				"cunt",
				"prick",
				"wanker",
				"douchebag",
				"crap",
				"piss off",
				"son of a bitch",
				"slut",
				"whore",
				"dumbass",
				"jackass",
				"fucker",
				"pussy",
				"twat",
				"freaking",
				"dick",
				"bullshit",
				"goddamn",
				"bloody hell",
				"arsehole",
				"idiot",
				"loser",
				"moron",
				"scumbag"
			],
			"responses": [
				"Please watch your language.",
				"Let's keep the conversation respectful.",
				"Kindly use appropriate words.",
				"Such words are not allowed."
			]
		}
	]
}
